baden/zephyr-soc-nuvoton-m2354/include/zephyr/dt-bindings/pinctrl/numaker-m2354-pinctrl.h
/* End of M2354 BSP sys_reg.h pin-mux module copy */



/* Beginning of M2354 BSP sys.h pin-mux module copy */

/*---------------------------------------------------------------------------------------------------------*/
/*  Multi-Function constant definitions.                                                                   */
/*---------------------------------------------------------------------------------------------------------*/

/* How to use below #define?

Example: If user want to set PA.1 as UART0_TXD and PA.0 as UART0_RXD in initial function,
         user can issue following command to achieve it.

    SYS->GPA_MFPL = (SYS->GPA_MFPL & (~SYS_GPA_MFPL_PA0MFP_Msk)) | SYS_GPA_MFPL_PA0MFP_UART0_RXD;
    SYS->GPA_MFPL = (SYS->GPA_MFPL & (~SYS_GPA_MFPL_PA1MFP_Msk)) | SYS_GPA_MFPL_PA1MFP_UART0_TXD;
*/


/* PA.0 MFP */
#define NUMAKER_SYS_GPA_MFPL_PA0MFP_GPIO            (0x0UL << NUMAKER_SYS_GPA_MFPL_PA0MFP_Pos)    /*!< GPA_MFPL PA0 setting for GPIO            */
#define NUMAKER_SYS_GPA_MFPL_PA0MFP_QSPI0_MOSI0     (0x3UL << NUMAKER_SYS_GPA_MFPL_PA0MFP_Pos)    /*!< GPA_MFPL PA0 setting for QSPI0_MOSI0     */
#define NUMAKER_SYS_GPA_MFPL_PA0MFP_SPI0_MOSI       (0x4UL << NUMAKER_SYS_GPA_MFPL_PA0MFP_Pos)    /*!< GPA_MFPL PA0 setting for SPI0_MOSI       */
#define NUMAKER_SYS_GPA_MFPL_PA0MFP_LCD_COM6        (0x5UL << NUMAKER_SYS_GPA_MFPL_PA0MFP_Pos)    /*!< GPA_MFPL PA0 setting for LCD_COM6        */
#define NUMAKER_SYS_GPA_MFPL_PA0MFP_LCD_SEG14       (0x5UL << NUMAKER_SYS_GPA_MFPL_PA0MFP_Pos)    /*!< GPA_MFPL PA0 setting for LCD_SEG14       */
#define NUMAKER_SYS_GPA_MFPL_PA0MFP_SC0_CLK         (0x6UL << NUMAKER_SYS_GPA_MFPL_PA0MFP_Pos)    /*!< GPA_MFPL PA0 setting for SC0_CLK         */
#define NUMAKER_SYS_GPA_MFPL_PA0MFP_UART0_RXD       (0x7UL << NUMAKER_SYS_GPA_MFPL_PA0MFP_Pos)    /*!< GPA_MFPL PA0 setting for UART0_RXD       */
#define NUMAKER_SYS_GPA_MFPL_PA0MFP_UART1_nRTS      (0x8UL << NUMAKER_SYS_GPA_MFPL_PA0MFP_Pos)    /*!< GPA_MFPL PA0 setting for UART1_nRTS      */
#define NUMAKER_SYS_GPA_MFPL_PA0MFP_I2C2_SDA        (0x9UL << NUMAKER_SYS_GPA_MFPL_PA0MFP_Pos)    /*!< GPA_MFPL PA0 setting for I2C2_SDA        */
#define NUMAKER_SYS_GPA_MFPL_PA0MFP_LCD_SEG24       (0xBUL << NUMAKER_SYS_GPA_MFPL_PA0MFP_Pos)    /*!< GPA_MFPL PA0 setting for LCD_SEG24       */
#define NUMAKER_SYS_GPA_MFPL_PA0MFP_BPWM0_CH0       (0xCUL << NUMAKER_SYS_GPA_MFPL_PA0MFP_Pos)    /*!< GPA_MFPL PA0 setting for BPWM0_CH0       */
#define NUMAKER_SYS_GPA_MFPL_PA0MFP_EPWM0_CH5       (0xDUL << NUMAKER_SYS_GPA_MFPL_PA0MFP_Pos)    /*!< GPA_MFPL PA0 setting for EPWM0_CH5       */
#define NUMAKER_SYS_GPA_MFPL_PA0MFP_DAC0_ST         (0xFUL << NUMAKER_SYS_GPA_MFPL_PA0MFP_Pos)    /*!< GPA_MFPL PA0 setting for DAC0_ST         */

/* PA.1 MFP */
#define NUMAKER_SYS_GPA_MFPL_PA1MFP_GPIO            (0x0UL << NUMAKER_SYS_GPA_MFPL_PA1MFP_Pos)    /*!< GPA_MFPL PA1 setting for GPIO            */
#define NUMAKER_SYS_GPA_MFPL_PA1MFP_QSPI0_MISO0     (0x3UL << NUMAKER_SYS_GPA_MFPL_PA1MFP_Pos)    /*!< GPA_MFPL PA1 setting for QSPI0_MISO0     */
#define NUMAKER_SYS_GPA_MFPL_PA1MFP_SPI0_MISO       (0x4UL << NUMAKER_SYS_GPA_MFPL_PA1MFP_Pos)    /*!< GPA_MFPL PA1 setting for SPI0_MISO       */
#define NUMAKER_SYS_GPA_MFPL_PA1MFP_LCD_COM7        (0x5UL << NUMAKER_SYS_GPA_MFPL_PA1MFP_Pos)    /*!< GPA_MFPL PA1 setting for LCD_COM7        */
#define NUMAKER_SYS_GPA_MFPL_PA1MFP_LCD_SEG13       (0x5UL << NUMAKER_SYS_GPA_MFPL_PA1MFP_Pos)    /*!< GPA_MFPL PA1 setting for LCD_SEG13       */
#define NUMAKER_SYS_GPA_MFPL_PA1MFP_SC0_DAT         (0x6UL << NUMAKER_SYS_GPA_MFPL_PA1MFP_Pos)    /*!< GPA_MFPL PA1 setting for SC0_DAT         */
#define NUMAKER_SYS_GPA_MFPL_PA1MFP_UART0_TXD       (0x7UL << NUMAKER_SYS_GPA_MFPL_PA1MFP_Pos)    /*!< GPA_MFPL PA1 setting for UART0_TXD       */
#define NUMAKER_SYS_GPA_MFPL_PA1MFP_UART1_nCTS      (0x8UL << NUMAKER_SYS_GPA_MFPL_PA1MFP_Pos)    /*!< GPA_MFPL PA1 setting for UART1_nCTS      */
#define NUMAKER_SYS_GPA_MFPL_PA1MFP_I2C2_SCL        (0x9UL << NUMAKER_SYS_GPA_MFPL_PA1MFP_Pos)    /*!< GPA_MFPL PA1 setting for I2C2_SCL        */
#define NUMAKER_SYS_GPA_MFPL_PA1MFP_LCD_SEG25       (0xBUL << NUMAKER_SYS_GPA_MFPL_PA1MFP_Pos)    /*!< GPA_MFPL PA1 setting for LCD_SEG25       */
#define NUMAKER_SYS_GPA_MFPL_PA1MFP_BPWM0_CH1       (0xCUL << NUMAKER_SYS_GPA_MFPL_PA1MFP_Pos)    /*!< GPA_MFPL PA1 setting for BPWM0_CH1       */
#define NUMAKER_SYS_GPA_MFPL_PA1MFP_EPWM0_CH4       (0xDUL << NUMAKER_SYS_GPA_MFPL_PA1MFP_Pos)    /*!< GPA_MFPL PA1 setting for EPWM0_CH4       */
#define NUMAKER_SYS_GPA_MFPL_PA1MFP_DAC1_ST         (0xFUL << NUMAKER_SYS_GPA_MFPL_PA1MFP_Pos)    /*!< GPA_MFPL PA1 setting for DAC1_ST         */

/* PA.2 MFP */
#define NUMAKER_SYS_GPA_MFPL_PA2MFP_GPIO            (0x0UL << NUMAKER_SYS_GPA_MFPL_PA2MFP_Pos)    /*!< GPA_MFPL PA2 setting for GPIO            */
#define NUMAKER_SYS_GPA_MFPL_PA2MFP_QSPI0_CLK       (0x3UL << NUMAKER_SYS_GPA_MFPL_PA2MFP_Pos)    /*!< GPA_MFPL PA2 setting for QSPI0_CLK       */
#define NUMAKER_SYS_GPA_MFPL_PA2MFP_SPI0_CLK        (0x4UL << NUMAKER_SYS_GPA_MFPL_PA2MFP_Pos)    /*!< GPA_MFPL PA2 setting for SPI0_CLK        */
#define NUMAKER_SYS_GPA_MFPL_PA2MFP_LCD_SEG3        (0x5UL << NUMAKER_SYS_GPA_MFPL_PA2MFP_Pos)    /*!< GPA_MFPL PA2 setting for LCD_SEG3        */
#define NUMAKER_SYS_GPA_MFPL_PA2MFP_SC0_RST         (0x6UL << NUMAKER_SYS_GPA_MFPL_PA2MFP_Pos)    /*!< GPA_MFPL PA2 setting for SC0_RST         */
#define NUMAKER_SYS_GPA_MFPL_PA2MFP_UART4_RXD       (0x7UL << NUMAKER_SYS_GPA_MFPL_PA2MFP_Pos)    /*!< GPA_MFPL PA2 setting for UART4_RXD       */
#define NUMAKER_SYS_GPA_MFPL_PA2MFP_UART1_RXD       (0x8UL << NUMAKER_SYS_GPA_MFPL_PA2MFP_Pos)    /*!< GPA_MFPL PA2 setting for UART1_RXD       */
#define NUMAKER_SYS_GPA_MFPL_PA2MFP_I2C1_SDA        (0x9UL << NUMAKER_SYS_GPA_MFPL_PA2MFP_Pos)    /*!< GPA_MFPL PA2 setting for I2C1_SDA        */
#define NUMAKER_SYS_GPA_MFPL_PA2MFP_I2C0_SMBSUS     (0xAUL << NUMAKER_SYS_GPA_MFPL_PA2MFP_Pos)    /*!< GPA_MFPL PA2 setting for I2C0_SMBSUS     */
#define NUMAKER_SYS_GPA_MFPL_PA2MFP_LCD_SEG26       (0xBUL << NUMAKER_SYS_GPA_MFPL_PA2MFP_Pos)    /*!< GPA_MFPL PA2 setting for LCD_SEG26       */
#define NUMAKER_SYS_GPA_MFPL_PA2MFP_BPWM0_CH2       (0xCUL << NUMAKER_SYS_GPA_MFPL_PA2MFP_Pos)    /*!< GPA_MFPL PA2 setting for BPWM0_CH2       */
#define NUMAKER_SYS_GPA_MFPL_PA2MFP_EPWM0_CH3       (0xDUL << NUMAKER_SYS_GPA_MFPL_PA2MFP_Pos)    /*!< GPA_MFPL PA2 setting for EPWM0_CH3       */

/* PA.3 MFP */
#define NUMAKER_SYS_GPA_MFPL_PA3MFP_GPIO            (0x0UL << NUMAKER_SYS_GPA_MFPL_PA3MFP_Pos)    /*!< GPA_MFPL PA3 setting for GPIO            */
#define NUMAKER_SYS_GPA_MFPL_PA3MFP_QSPI0_SS        (0x3UL << NUMAKER_SYS_GPA_MFPL_PA3MFP_Pos)    /*!< GPA_MFPL PA3 setting for QSPI0_SS        */
#define NUMAKER_SYS_GPA_MFPL_PA3MFP_SPI0_SS         (0x4UL << NUMAKER_SYS_GPA_MFPL_PA3MFP_Pos)    /*!< GPA_MFPL PA3 setting for SPI0_SS         */
#define NUMAKER_SYS_GPA_MFPL_PA3MFP_LCD_SEG4        (0x5UL << NUMAKER_SYS_GPA_MFPL_PA3MFP_Pos)    /*!< GPA_MFPL PA3 setting for LCD_SEG4        */
#define NUMAKER_SYS_GPA_MFPL_PA3MFP_SC0_PWR         (0x6UL << NUMAKER_SYS_GPA_MFPL_PA3MFP_Pos)    /*!< GPA_MFPL PA3 setting for SC0_PWR         */
#define NUMAKER_SYS_GPA_MFPL_PA3MFP_UART4_TXD       (0x7UL << NUMAKER_SYS_GPA_MFPL_PA3MFP_Pos)    /*!< GPA_MFPL PA3 setting for UART4_TXD       */
#define NUMAKER_SYS_GPA_MFPL_PA3MFP_UART1_TXD       (0x8UL << NUMAKER_SYS_GPA_MFPL_PA3MFP_Pos)    /*!< GPA_MFPL PA3 setting for UART1_TXD       */
#define NUMAKER_SYS_GPA_MFPL_PA3MFP_I2C1_SCL        (0x9UL << NUMAKER_SYS_GPA_MFPL_PA3MFP_Pos)    /*!< GPA_MFPL PA3 setting for I2C1_SCL        */
#define NUMAKER_SYS_GPA_MFPL_PA3MFP_I2C0_SMBAL      (0xAUL << NUMAKER_SYS_GPA_MFPL_PA3MFP_Pos)    /*!< GPA_MFPL PA3 setting for I2C0_SMBAL      */
#define NUMAKER_SYS_GPA_MFPL_PA3MFP_LCD_SEG27       (0xBUL << NUMAKER_SYS_GPA_MFPL_PA3MFP_Pos)    /*!< GPA_MFPL PA3 setting for LCD_SEG27       */
#define NUMAKER_SYS_GPA_MFPL_PA3MFP_BPWM0_CH3       (0xCUL << NUMAKER_SYS_GPA_MFPL_PA3MFP_Pos)    /*!< GPA_MFPL PA3 setting for BPWM0_CH3       */
#define NUMAKER_SYS_GPA_MFPL_PA3MFP_EPWM0_CH2       (0xDUL << NUMAKER_SYS_GPA_MFPL_PA3MFP_Pos)    /*!< GPA_MFPL PA3 setting for EPWM0_CH2       */
#define NUMAKER_SYS_GPA_MFPL_PA3MFP_QEI0_B          (0xEUL << NUMAKER_SYS_GPA_MFPL_PA3MFP_Pos)    /*!< GPA_MFPL PA3 setting for QEI0_B          */
#define NUMAKER_SYS_GPA_MFPL_PA3MFP_EPWM1_BRAKE1    (0xFUL << NUMAKER_SYS_GPA_MFPL_PA3MFP_Pos)    /*!< GPA_MFPL PA3 setting for EPWM1_BRAKE1    */

/* PA.4 MFP */
#define NUMAKER_SYS_GPA_MFPL_PA4MFP_GPIO            (0x0UL << NUMAKER_SYS_GPA_MFPL_PA4MFP_Pos)    /*!< GPA_MFPL PA4 setting for GPIO            */
#define NUMAKER_SYS_GPA_MFPL_PA4MFP_QSPI0_MOSI1     (0x3UL << NUMAKER_SYS_GPA_MFPL_PA4MFP_Pos)    /*!< GPA_MFPL PA4 setting for QSPI0_MOSI1     */
#define NUMAKER_SYS_GPA_MFPL_PA4MFP_SPI0_I2SMCLK    (0x4UL << NUMAKER_SYS_GPA_MFPL_PA4MFP_Pos)    /*!< GPA_MFPL PA4 setting for SPI0_I2SMCLK    */
#define NUMAKER_SYS_GPA_MFPL_PA4MFP_LCD_SEG5        (0x5UL << NUMAKER_SYS_GPA_MFPL_PA4MFP_Pos)    /*!< GPA_MFPL PA4 setting for LCD_SEG5        */
#define NUMAKER_SYS_GPA_MFPL_PA4MFP_SC0_nCD         (0x6UL << NUMAKER_SYS_GPA_MFPL_PA4MFP_Pos)    /*!< GPA_MFPL PA4 setting for SC0_nCD         */
#define NUMAKER_SYS_GPA_MFPL_PA4MFP_UART0_nRTS      (0x7UL << NUMAKER_SYS_GPA_MFPL_PA4MFP_Pos)    /*!< GPA_MFPL PA4 setting for UART0_nRTS      */
#define NUMAKER_SYS_GPA_MFPL_PA4MFP_UART5_RXD       (0x8UL << NUMAKER_SYS_GPA_MFPL_PA4MFP_Pos)    /*!< GPA_MFPL PA4 setting for UART5_RXD       */
#define NUMAKER_SYS_GPA_MFPL_PA4MFP_I2C0_SDA        (0x9UL << NUMAKER_SYS_GPA_MFPL_PA4MFP_Pos)    /*!< GPA_MFPL PA4 setting for I2C0_SDA        */
#define NUMAKER_SYS_GPA_MFPL_PA4MFP_CAN0_RXD        (0xAUL << NUMAKER_SYS_GPA_MFPL_PA4MFP_Pos)    /*!< GPA_MFPL PA4 setting for CAN0_RXD        */
#define NUMAKER_SYS_GPA_MFPL_PA4MFP_UART0_RXD       (0xBUL << NUMAKER_SYS_GPA_MFPL_PA4MFP_Pos)    /*!< GPA_MFPL PA4 setting for UART0_RXD       */
#define NUMAKER_SYS_GPA_MFPL_PA4MFP_BPWM0_CH4       (0xCUL << NUMAKER_SYS_GPA_MFPL_PA4MFP_Pos)    /*!< GPA_MFPL PA4 setting for BPWM0_CH4       */
#define NUMAKER_SYS_GPA_MFPL_PA4MFP_EPWM0_CH1       (0xDUL << NUMAKER_SYS_GPA_MFPL_PA4MFP_Pos)    /*!< GPA_MFPL PA4 setting for EPWM0_CH1       */
#define NUMAKER_SYS_GPA_MFPL_PA4MFP_QEI0_A          (0xEUL << NUMAKER_SYS_GPA_MFPL_PA4MFP_Pos)    /*!< GPA_MFPL PA4 setting for QEI0_A          */
#define NUMAKER_SYS_GPA_MFPL_PA4MFP_LCD_SEG28       (0xFUL << NUMAKER_SYS_GPA_MFPL_PA4MFP_Pos)    /*!< GPA_MFPL PA4 setting for LCD_SEG28       */

