baden/zephyr-soc-nuvoton-m2354/include/zephyr/dt-bindings/pinctrl/numaker-m2354-pinctrl.h
/* PB.3 MFP */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_GPIO            (0x0UL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for GPIO            */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_ACMP0_N         (0x1UL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for ACMP0_N         */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_EADC0_CH3       (0x1UL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for EADC0_CH3       */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_EBI_ADR2        (0x2UL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for EBI_ADR2        */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_SD0_DAT1        (0x3UL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for SD0_DAT1        */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_SPI1_CLK        (0x5UL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for SPI1_CLK        */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_UART1_TXD       (0x6UL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for UART1_TXD       */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_UART5_nRTS      (0x7UL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for UART5_nRTS      */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_USCI1_DAT1      (0x8UL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for USCI1_DAT1      */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_SC0_RST         (0x9UL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for SC0_RST         */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_I2S0_DI         (0xAUL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for I2S0_DI         */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_EPWM0_CH2       (0xBUL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for EPWM0_CH2       */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_I2C1_SCL        (0xCUL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for I2C1_SCL        */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_TM4             (0xDUL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for TM4             */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_TM2             (0xEUL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for TM2             */
#define NUMAKER_SYS_GPB_MFPL_PB3MFP_INT2            (0xFUL << NUMAKER_SYS_GPB_MFPL_PB3MFP_Pos)    /*!< GPB_MFPL PB3 setting for INT2            */

/* PB.4 MFP */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_GPIO            (0x0UL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for GPIO            */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_ACMP1_P1        (0x1UL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for ACMP1_P1        */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_EADC0_CH4       (0x1UL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for EADC0_CH4       */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_EBI_ADR1        (0x2UL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for EBI_ADR1        */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_SD0_DAT2        (0x3UL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for SD0_DAT2        */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_SPI1_MOSI       (0x5UL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for SPI1_MOSI       */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_I2C0_SDA        (0x6UL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for I2C0_SDA        */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_UART5_RXD       (0x7UL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for UART5_RXD       */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_USCI1_CTL1      (0x8UL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for USCI1_CTL1      */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_SC0_DAT         (0x9UL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for SC0_DAT         */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_I2S0_MCLK       (0xAUL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for I2S0_MCLK       */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_EPWM0_CH1       (0xBUL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for EPWM0_CH1       */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_UART2_RXD       (0xCUL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for UART2_RXD       */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_TM1             (0xEUL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for TM1             */
#define NUMAKER_SYS_GPB_MFPL_PB4MFP_INT1            (0xFUL << NUMAKER_SYS_GPB_MFPL_PB4MFP_Pos)    /*!< GPB_MFPL PB4 setting for INT1            */

/* PB.5 MFP */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_GPIO            (0x0UL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for GPIO            */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_ACMP1_N         (0x1UL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for ACMP1_N         */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_EADC0_CH5       (0x1UL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for EADC0_CH5       */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_EBI_ADR0        (0x2UL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for EBI_ADR0        */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_SD0_DAT3        (0x3UL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for SD0_DAT3        */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_SPI1_MISO       (0x5UL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for SPI1_MISO       */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_I2C0_SCL        (0x6UL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for I2C0_SCL        */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_UART5_TXD       (0x7UL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for UART5_TXD       */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_USCI1_CTL0      (0x8UL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for USCI1_CTL0      */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_SC0_CLK         (0x9UL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for SC0_CLK         */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_I2S0_BCLK       (0xAUL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for I2S0_BCLK       */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_EPWM0_CH0       (0xBUL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for EPWM0_CH0       */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_UART2_TXD       (0xCUL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for UART2_TXD       */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_TM0             (0xEUL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for TM0             */
#define NUMAKER_SYS_GPB_MFPL_PB5MFP_INT0            (0xFUL << NUMAKER_SYS_GPB_MFPL_PB5MFP_Pos)    /*!< GPB_MFPL PB5 setting for INT0            */

