baden/zephyr-soc-nuvoton-m2354/include/zephyr/dt-bindings/pinctrl/numaker-m2354-pinctrl.h
/* PB.6 MFP */
#define NUMAKER_SYS_GPB_MFPL_PB6MFP_GPIO            (0x0UL << NUMAKER_SYS_GPB_MFPL_PB6MFP_Pos)    /*!< GPB_MFPL PB6 setting for GPIO            */
#define NUMAKER_SYS_GPB_MFPL_PB6MFP_EADC0_CH6       (0x1UL << NUMAKER_SYS_GPB_MFPL_PB6MFP_Pos)    /*!< GPB_MFPL PB6 setting for EADC0_CH6       */
#define NUMAKER_SYS_GPB_MFPL_PB6MFP_EBI_nWRH        (0x2UL << NUMAKER_SYS_GPB_MFPL_PB6MFP_Pos)    /*!< GPB_MFPL PB6 setting for EBI_nWRH        */
#define NUMAKER_SYS_GPB_MFPL_PB6MFP_USCI1_DAT1      (0x4UL << NUMAKER_SYS_GPB_MFPL_PB6MFP_Pos)    /*!< GPB_MFPL PB6 setting for USCI1_DAT1      */
#define NUMAKER_SYS_GPB_MFPL_PB6MFP_UART1_RXD       (0x6UL << NUMAKER_SYS_GPB_MFPL_PB6MFP_Pos)    /*!< GPB_MFPL PB6 setting for UART1_RXD       */
#define NUMAKER_SYS_GPB_MFPL_PB6MFP_EBI_nCS1        (0x8UL << NUMAKER_SYS_GPB_MFPL_PB6MFP_Pos)    /*!< GPB_MFPL PB6 setting for EBI_nCS1        */
#define NUMAKER_SYS_GPB_MFPL_PB6MFP_BPWM1_CH5       (0xAUL << NUMAKER_SYS_GPB_MFPL_PB6MFP_Pos)    /*!< GPB_MFPL PB6 setting for BPWM1_CH5       */
#define NUMAKER_SYS_GPB_MFPL_PB6MFP_EPWM1_BRAKE1    (0xBUL << NUMAKER_SYS_GPB_MFPL_PB6MFP_Pos)    /*!< GPB_MFPL PB6 setting for EPWM1_BRAKE1    */
#define NUMAKER_SYS_GPB_MFPL_PB6MFP_EPWM1_CH5       (0xCUL << NUMAKER_SYS_GPB_MFPL_PB6MFP_Pos)    /*!< GPB_MFPL PB6 setting for EPWM1_CH5       */
#define NUMAKER_SYS_GPB_MFPL_PB6MFP_INT4            (0xDUL << NUMAKER_SYS_GPB_MFPL_PB6MFP_Pos)    /*!< GPB_MFPL PB6 setting for INT4            */
#define NUMAKER_SYS_GPB_MFPL_PB6MFP_USB_VBUS_EN     (0xEUL << NUMAKER_SYS_GPB_MFPL_PB6MFP_Pos)    /*!< GPB_MFPL PB6 setting for USB_VBUS_EN     */
#define NUMAKER_SYS_GPB_MFPL_PB6MFP_ACMP1_O         (0xFUL << NUMAKER_SYS_GPB_MFPL_PB6MFP_Pos)    /*!< GPB_MFPL PB6 setting for ACMP1_O         */

/* PB.7 MFP */
#define NUMAKER_SYS_GPB_MFPL_PB7MFP_GPIO            (0x0UL << NUMAKER_SYS_GPB_MFPL_PB7MFP_Pos)    /*!< GPB_MFPL PB7 setting for GPIO            */
#define NUMAKER_SYS_GPB_MFPL_PB7MFP_EADC0_CH7       (0x1UL << NUMAKER_SYS_GPB_MFPL_PB7MFP_Pos)    /*!< GPB_MFPL PB7 setting for EADC0_CH7       */
#define NUMAKER_SYS_GPB_MFPL_PB7MFP_EBI_nWRL        (0x2UL << NUMAKER_SYS_GPB_MFPL_PB7MFP_Pos)    /*!< GPB_MFPL PB7 setting for EBI_nWRL        */
#define NUMAKER_SYS_GPB_MFPL_PB7MFP_USCI1_DAT0      (0x4UL << NUMAKER_SYS_GPB_MFPL_PB7MFP_Pos)    /*!< GPB_MFPL PB7 setting for USCI1_DAT0      */
#define NUMAKER_SYS_GPB_MFPL_PB7MFP_UART1_TXD       (0x6UL << NUMAKER_SYS_GPB_MFPL_PB7MFP_Pos)    /*!< GPB_MFPL PB7 setting for UART1_TXD       */
#define NUMAKER_SYS_GPB_MFPL_PB7MFP_EBI_nCS0        (0x8UL << NUMAKER_SYS_GPB_MFPL_PB7MFP_Pos)    /*!< GPB_MFPL PB7 setting for EBI_nCS0        */
#define NUMAKER_SYS_GPB_MFPL_PB7MFP_BPWM1_CH4       (0xAUL << NUMAKER_SYS_GPB_MFPL_PB7MFP_Pos)    /*!< GPB_MFPL PB7 setting for BPWM1_CH4       */
#define NUMAKER_SYS_GPB_MFPL_PB7MFP_EPWM1_BRAKE0    (0xBUL << NUMAKER_SYS_GPB_MFPL_PB7MFP_Pos)    /*!< GPB_MFPL PB7 setting for EPWM1_BRAKE0    */
#define NUMAKER_SYS_GPB_MFPL_PB7MFP_EPWM1_CH4       (0xCUL << NUMAKER_SYS_GPB_MFPL_PB7MFP_Pos)    /*!< GPB_MFPL PB7 setting for EPWM1_CH4       */
#define NUMAKER_SYS_GPB_MFPL_PB7MFP_INT5            (0xDUL << NUMAKER_SYS_GPB_MFPL_PB7MFP_Pos)    /*!< GPB_MFPL PB7 setting for INT5            */
#define NUMAKER_SYS_GPB_MFPL_PB7MFP_USB_VBUS_ST     (0xEUL << NUMAKER_SYS_GPB_MFPL_PB7MFP_Pos)    /*!< GPB_MFPL PB7 setting for USB_VBUS_ST     */
#define NUMAKER_SYS_GPB_MFPL_PB7MFP_ACMP0_O         (0xFUL << NUMAKER_SYS_GPB_MFPL_PB7MFP_Pos)    /*!< GPB_MFPL PB7 setting for ACMP0_O         */

/* PB.8 MFP */
#define NUMAKER_SYS_GPB_MFPH_PB8MFP_GPIO            (0x0UL << NUMAKER_SYS_GPB_MFPH_PB8MFP_Pos)    /*!< GPB_MFPH PB8 setting for GPIO            */
#define NUMAKER_SYS_GPB_MFPH_PB8MFP_EADC0_CH8       (0x1UL << NUMAKER_SYS_GPB_MFPH_PB8MFP_Pos)    /*!< GPB_MFPH PB8 setting for EADC0_CH8       */
#define NUMAKER_SYS_GPB_MFPH_PB8MFP_EBI_ADR19       (0x2UL << NUMAKER_SYS_GPB_MFPH_PB8MFP_Pos)    /*!< GPB_MFPH PB8 setting for EBI_ADR19       */
#define NUMAKER_SYS_GPB_MFPH_PB8MFP_USCI1_CLK       (0x4UL << NUMAKER_SYS_GPB_MFPH_PB8MFP_Pos)    /*!< GPB_MFPH PB8 setting for USCI1_CLK       */
#define NUMAKER_SYS_GPB_MFPH_PB8MFP_UART0_RXD       (0x5UL << NUMAKER_SYS_GPB_MFPH_PB8MFP_Pos)    /*!< GPB_MFPH PB8 setting for UART0_RXD       */
#define NUMAKER_SYS_GPB_MFPH_PB8MFP_UART1_nRTS      (0x6UL << NUMAKER_SYS_GPB_MFPH_PB8MFP_Pos)    /*!< GPB_MFPH PB8 setting for UART1_nRTS      */
#define NUMAKER_SYS_GPB_MFPH_PB8MFP_I2C1_SMBSUS     (0x7UL << NUMAKER_SYS_GPB_MFPH_PB8MFP_Pos)    /*!< GPB_MFPH PB8 setting for I2C1_SMBSUS     */
#define NUMAKER_SYS_GPB_MFPH_PB8MFP_I2C0_SDA        (0x9UL << NUMAKER_SYS_GPB_MFPH_PB8MFP_Pos)    /*!< GPB_MFPH PB8 setting for I2C0_SDA        */
#define NUMAKER_SYS_GPB_MFPH_PB8MFP_BPWM1_CH3       (0xAUL << NUMAKER_SYS_GPB_MFPH_PB8MFP_Pos)    /*!< GPB_MFPH PB8 setting for BPWM1_CH3       */
#define NUMAKER_SYS_GPB_MFPH_PB8MFP_SPI3_MOSI       (0xBUL << NUMAKER_SYS_GPB_MFPH_PB8MFP_Pos)    /*!< GPB_MFPH PB8 setting for SPI3_MOSI       */
#define NUMAKER_SYS_GPB_MFPH_PB8MFP_INT6            (0xDUL << NUMAKER_SYS_GPB_MFPH_PB8MFP_Pos)    /*!< GPB_MFPH PB8 setting for INT6            */

/* PB.9 MFP */
#define NUMAKER_SYS_GPB_MFPH_PB9MFP_GPIO            (0x0UL << NUMAKER_SYS_GPB_MFPH_PB9MFP_Pos)    /*!< GPB_MFPH PB9 setting for GPIO            */
#define NUMAKER_SYS_GPB_MFPH_PB9MFP_EADC0_CH9       (0x1UL << NUMAKER_SYS_GPB_MFPH_PB9MFP_Pos)    /*!< GPB_MFPH PB9 setting for EADC0_CH9       */
#define NUMAKER_SYS_GPB_MFPH_PB9MFP_EBI_ADR18       (0x2UL << NUMAKER_SYS_GPB_MFPH_PB9MFP_Pos)    /*!< GPB_MFPH PB9 setting for EBI_ADR18       */
#define NUMAKER_SYS_GPB_MFPH_PB9MFP_USCI1_CTL1      (0x4UL << NUMAKER_SYS_GPB_MFPH_PB9MFP_Pos)    /*!< GPB_MFPH PB9 setting for USCI1_CTL1      */
#define NUMAKER_SYS_GPB_MFPH_PB9MFP_UART0_TXD       (0x5UL << NUMAKER_SYS_GPB_MFPH_PB9MFP_Pos)    /*!< GPB_MFPH PB9 setting for UART0_TXD       */
#define NUMAKER_SYS_GPB_MFPH_PB9MFP_UART1_nCTS      (0x6UL << NUMAKER_SYS_GPB_MFPH_PB9MFP_Pos)    /*!< GPB_MFPH PB9 setting for UART1_nCTS      */
#define NUMAKER_SYS_GPB_MFPH_PB9MFP_I2C1_SMBAL      (0x7UL << NUMAKER_SYS_GPB_MFPH_PB9MFP_Pos)    /*!< GPB_MFPH PB9 setting for I2C1_SMBAL      */
#define NUMAKER_SYS_GPB_MFPH_PB9MFP_I2C0_SCL        (0x9UL << NUMAKER_SYS_GPB_MFPH_PB9MFP_Pos)    /*!< GPB_MFPH PB9 setting for I2C0_SCL        */
#define NUMAKER_SYS_GPB_MFPH_PB9MFP_BPWM1_CH2       (0xAUL << NUMAKER_SYS_GPB_MFPH_PB9MFP_Pos)    /*!< GPB_MFPH PB9 setting for BPWM1_CH2       */
#define NUMAKER_SYS_GPB_MFPH_PB9MFP_SPI3_MISO       (0xBUL << NUMAKER_SYS_GPB_MFPH_PB9MFP_Pos)    /*!< GPB_MFPH PB9 setting for SPI3_MISO       */
#define NUMAKER_SYS_GPB_MFPH_PB9MFP_INT7            (0xDUL << NUMAKER_SYS_GPB_MFPH_PB9MFP_Pos)    /*!< GPB_MFPH PB9 setting for INT7            */

/* PB.10 MFP */
#define NUMAKER_SYS_GPB_MFPH_PB10MFP_GPIO           (0x0UL << NUMAKER_SYS_GPB_MFPH_PB10MFP_Pos)   /*!< GPB_MFPH PB10 setting for GPIO           */
#define NUMAKER_SYS_GPB_MFPH_PB10MFP_EADC0_CH10     (0x1UL << NUMAKER_SYS_GPB_MFPH_PB10MFP_Pos)   /*!< GPB_MFPH PB10 setting for EADC0_CH10     */
#define NUMAKER_SYS_GPB_MFPH_PB10MFP_EBI_ADR17      (0x2UL << NUMAKER_SYS_GPB_MFPH_PB10MFP_Pos)   /*!< GPB_MFPH PB10 setting for EBI_ADR17      */
#define NUMAKER_SYS_GPB_MFPH_PB10MFP_USCI1_CTL0     (0x4UL << NUMAKER_SYS_GPB_MFPH_PB10MFP_Pos)   /*!< GPB_MFPH PB10 setting for USCI1_CTL0     */
#define NUMAKER_SYS_GPB_MFPH_PB10MFP_UART0_nRTS     (0x5UL << NUMAKER_SYS_GPB_MFPH_PB10MFP_Pos)   /*!< GPB_MFPH PB10 setting for UART0_nRTS     */
#define NUMAKER_SYS_GPB_MFPH_PB10MFP_UART4_RXD      (0x6UL << NUMAKER_SYS_GPB_MFPH_PB10MFP_Pos)   /*!< GPB_MFPH PB10 setting for UART4_RXD      */
#define NUMAKER_SYS_GPB_MFPH_PB10MFP_I2C1_SDA       (0x7UL << NUMAKER_SYS_GPB_MFPH_PB10MFP_Pos)   /*!< GPB_MFPH PB10 setting for I2C1_SDA       */
#define NUMAKER_SYS_GPB_MFPH_PB10MFP_CAN0_RXD       (0x8UL << NUMAKER_SYS_GPB_MFPH_PB10MFP_Pos)   /*!< GPB_MFPH PB10 setting for CAN0_RXD       */
#define NUMAKER_SYS_GPB_MFPH_PB10MFP_BPWM1_CH1      (0xAUL << NUMAKER_SYS_GPB_MFPH_PB10MFP_Pos)   /*!< GPB_MFPH PB10 setting for BPWM1_CH1      */
#define NUMAKER_SYS_GPB_MFPH_PB10MFP_SPI3_SS        (0xBUL << NUMAKER_SYS_GPB_MFPH_PB10MFP_Pos)   /*!< GPB_MFPH PB10 setting for SPI3_SS        */

/* PB.11 MFP */
#define NUMAKER_SYS_GPB_MFPH_PB11MFP_GPIO           (0x0UL << NUMAKER_SYS_GPB_MFPH_PB11MFP_Pos)   /*!< GPB_MFPH PB11 setting for GPIO           */
#define NUMAKER_SYS_GPB_MFPH_PB11MFP_EADC0_CH11     (0x1UL << NUMAKER_SYS_GPB_MFPH_PB11MFP_Pos)   /*!< GPB_MFPH PB11 setting for EADC0_CH11     */
#define NUMAKER_SYS_GPB_MFPH_PB11MFP_EBI_ADR16      (0x2UL << NUMAKER_SYS_GPB_MFPH_PB11MFP_Pos)   /*!< GPB_MFPH PB11 setting for EBI_ADR16      */
#define NUMAKER_SYS_GPB_MFPH_PB11MFP_UART0_nCTS     (0x5UL << NUMAKER_SYS_GPB_MFPH_PB11MFP_Pos)   /*!< GPB_MFPH PB11 setting for UART0_nCTS     */
#define NUMAKER_SYS_GPB_MFPH_PB11MFP_UART4_TXD      (0x6UL << NUMAKER_SYS_GPB_MFPH_PB11MFP_Pos)   /*!< GPB_MFPH PB11 setting for UART4_TXD      */
#define NUMAKER_SYS_GPB_MFPH_PB11MFP_I2C1_SCL       (0x7UL << NUMAKER_SYS_GPB_MFPH_PB11MFP_Pos)   /*!< GPB_MFPH PB11 setting for I2C1_SCL       */
#define NUMAKER_SYS_GPB_MFPH_PB11MFP_CAN0_TXD       (0x8UL << NUMAKER_SYS_GPB_MFPH_PB11MFP_Pos)   /*!< GPB_MFPH PB11 setting for CAN0_TXD       */
#define NUMAKER_SYS_GPB_MFPH_PB11MFP_SPI0_I2SMCLK   (0x9UL << NUMAKER_SYS_GPB_MFPH_PB11MFP_Pos)   /*!< GPB_MFPH PB11 setting for SPI0_I2SMCLK   */
#define NUMAKER_SYS_GPB_MFPH_PB11MFP_BPWM1_CH0      (0xAUL << NUMAKER_SYS_GPB_MFPH_PB11MFP_Pos)   /*!< GPB_MFPH PB11 setting for BPWM1_CH0      */
#define NUMAKER_SYS_GPB_MFPH_PB11MFP_SPI3_CLK       (0xBUL << NUMAKER_SYS_GPB_MFPH_PB11MFP_Pos)   /*!< GPB_MFPH PB11 setting for SPI3_CLK       */

/* PB.12 MFP */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_GPIO           (0x0UL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for GPIO           */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_ACMP0_P2       (0x1UL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for ACMP0_P2       */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_ACMP1_P2       (0x1UL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for ACMP1_P2       */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_DAC0_OUT       (0x1UL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for DAC0_OUT       */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_EADC0_CH12     (0x1UL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for EADC0_CH12     */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_EBI_AD15       (0x2UL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for EBI_AD15       */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_SC1_CLK        (0x3UL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for SC1_CLK        */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_SPI0_MOSI      (0x4UL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for SPI0_MOSI      */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_USCI0_CLK      (0x5UL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for USCI0_CLK      */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_UART0_RXD      (0x6UL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for UART0_RXD      */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_UART3_nCTS     (0x7UL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for UART3_nCTS     */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_I2C2_SDA       (0x8UL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for I2C2_SDA       */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_SD0_nCD        (0x9UL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for SD0_nCD        */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_EPWM1_CH3      (0xBUL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for EPWM1_CH3      */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_TM3_EXT        (0xDUL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for TM3_EXT        */
#define NUMAKER_SYS_GPB_MFPH_PB12MFP_TM5_EXT        (0xEUL << NUMAKER_SYS_GPB_MFPH_PB12MFP_Pos)   /*!< GPB_MFPH PB12 setting for TM5_EXT        */

