baden/zephyr-soc-nuvoton-m2354/include/zephyr/dt-bindings/pinctrl/numaker-m2354-pinctrl.h
/* PC.13 MFP */
#define NUMAKER_SYS_GPC_MFPH_PC13MFP_GPIO           (0x0UL << NUMAKER_SYS_GPC_MFPH_PC13MFP_Pos)   /*!< GPC_MFPH PC13 setting for GPIO           */
#define NUMAKER_SYS_GPC_MFPH_PC13MFP_EBI_ADR10      (0x2UL << NUMAKER_SYS_GPC_MFPH_PC13MFP_Pos)   /*!< GPC_MFPH PC13 setting for EBI_ADR10      */
#define NUMAKER_SYS_GPC_MFPH_PC13MFP_SC2_nCD        (0x3UL << NUMAKER_SYS_GPC_MFPH_PC13MFP_Pos)   /*!< GPC_MFPH PC13 setting for SC2_nCD        */
#define NUMAKER_SYS_GPC_MFPH_PC13MFP_SPI2_I2SMCLK   (0x4UL << NUMAKER_SYS_GPC_MFPH_PC13MFP_Pos)   /*!< GPC_MFPH PC13 setting for SPI2_I2SMCLK   */
#define NUMAKER_SYS_GPC_MFPH_PC13MFP_USCI0_CTL0     (0x6UL << NUMAKER_SYS_GPC_MFPH_PC13MFP_Pos)   /*!< GPC_MFPH PC13 setting for USCI0_CTL0     */
#define NUMAKER_SYS_GPC_MFPH_PC13MFP_UART2_TXD      (0x7UL << NUMAKER_SYS_GPC_MFPH_PC13MFP_Pos)   /*!< GPC_MFPH PC13 setting for UART2_TXD      */
#define NUMAKER_SYS_GPC_MFPH_PC13MFP_BPWM0_CH4      (0x9UL << NUMAKER_SYS_GPC_MFPH_PC13MFP_Pos)   /*!< GPC_MFPH PC13 setting for BPWM0_CH4      */
#define NUMAKER_SYS_GPC_MFPH_PC13MFP_CLKO           (0xDUL << NUMAKER_SYS_GPC_MFPH_PC13MFP_Pos)   /*!< GPC_MFPH PC13 setting for CLKO           */
#define NUMAKER_SYS_GPC_MFPH_PC13MFP_EADC0_ST       (0xEUL << NUMAKER_SYS_GPC_MFPH_PC13MFP_Pos)   /*!< GPC_MFPH PC13 setting for EADC0_ST       */

/* PD.0 MFP */
#define NUMAKER_SYS_GPD_MFPL_PD0MFP_GPIO            (0x0UL << NUMAKER_SYS_GPD_MFPL_PD0MFP_Pos)    /*!< GPD_MFPL PD0 setting for GPIO            */
#define NUMAKER_SYS_GPD_MFPL_PD0MFP_EBI_AD13        (0x2UL << NUMAKER_SYS_GPD_MFPL_PD0MFP_Pos)    /*!< GPD_MFPL PD0 setting for EBI_AD13        */
#define NUMAKER_SYS_GPD_MFPL_PD0MFP_USCI0_CLK       (0x3UL << NUMAKER_SYS_GPD_MFPL_PD0MFP_Pos)    /*!< GPD_MFPL PD0 setting for USCI0_CLK       */
#define NUMAKER_SYS_GPD_MFPL_PD0MFP_SPI0_MOSI       (0x4UL << NUMAKER_SYS_GPD_MFPL_PD0MFP_Pos)    /*!< GPD_MFPL PD0 setting for SPI0_MOSI       */
#define NUMAKER_SYS_GPD_MFPL_PD0MFP_UART3_RXD       (0x5UL << NUMAKER_SYS_GPD_MFPL_PD0MFP_Pos)    /*!< GPD_MFPL PD0 setting for UART3_RXD       */
#define NUMAKER_SYS_GPD_MFPL_PD0MFP_I2C2_SDA        (0x6UL << NUMAKER_SYS_GPD_MFPL_PD0MFP_Pos)    /*!< GPD_MFPL PD0 setting for I2C2_SDA        */
#define NUMAKER_SYS_GPD_MFPL_PD0MFP_SC2_CLK         (0x7UL << NUMAKER_SYS_GPD_MFPL_PD0MFP_Pos)    /*!< GPD_MFPL PD0 setting for SC2_CLK         */
#define NUMAKER_SYS_GPD_MFPL_PD0MFP_TM2             (0xEUL << NUMAKER_SYS_GPD_MFPL_PD0MFP_Pos)    /*!< GPD_MFPL PD0 setting for TM2             */

/* PD.1 MFP */
#define NUMAKER_SYS_GPD_MFPL_PD1MFP_GPIO            (0x0UL << NUMAKER_SYS_GPD_MFPL_PD1MFP_Pos)    /*!< GPD_MFPL PD1 setting for GPIO            */
#define NUMAKER_SYS_GPD_MFPL_PD1MFP_EBI_AD12        (0x2UL << NUMAKER_SYS_GPD_MFPL_PD1MFP_Pos)    /*!< GPD_MFPL PD1 setting for EBI_AD12        */
#define NUMAKER_SYS_GPD_MFPL_PD1MFP_USCI0_DAT0      (0x3UL << NUMAKER_SYS_GPD_MFPL_PD1MFP_Pos)    /*!< GPD_MFPL PD1 setting for USCI0_DAT0      */
#define NUMAKER_SYS_GPD_MFPL_PD1MFP_SPI0_MISO       (0x4UL << NUMAKER_SYS_GPD_MFPL_PD1MFP_Pos)    /*!< GPD_MFPL PD1 setting for SPI0_MISO       */
#define NUMAKER_SYS_GPD_MFPL_PD1MFP_UART3_TXD       (0x5UL << NUMAKER_SYS_GPD_MFPL_PD1MFP_Pos)    /*!< GPD_MFPL PD1 setting for UART3_TXD       */
#define NUMAKER_SYS_GPD_MFPL_PD1MFP_I2C2_SCL        (0x6UL << NUMAKER_SYS_GPD_MFPL_PD1MFP_Pos)    /*!< GPD_MFPL PD1 setting for I2C2_SCL        */
#define NUMAKER_SYS_GPD_MFPL_PD1MFP_SC2_DAT         (0x7UL << NUMAKER_SYS_GPD_MFPL_PD1MFP_Pos)    /*!< GPD_MFPL PD1 setting for SC2_DAT         */
#define NUMAKER_SYS_GPD_MFPL_PD1MFP_LCD_SEG0        (0xFUL << NUMAKER_SYS_GPD_MFPL_PD1MFP_Pos)    /*!< GPD_MFPL PD1 setting for LCD_SEG0        */

/* PD.2 MFP */
#define NUMAKER_SYS_GPD_MFPL_PD2MFP_GPIO            (0x0UL << NUMAKER_SYS_GPD_MFPL_PD2MFP_Pos)    /*!< GPD_MFPL PD2 setting for GPIO            */
#define NUMAKER_SYS_GPD_MFPL_PD2MFP_EBI_AD11        (0x2UL << NUMAKER_SYS_GPD_MFPL_PD2MFP_Pos)    /*!< GPD_MFPL PD2 setting for EBI_AD11        */
#define NUMAKER_SYS_GPD_MFPL_PD2MFP_USCI0_DAT1      (0x3UL << NUMAKER_SYS_GPD_MFPL_PD2MFP_Pos)    /*!< GPD_MFPL PD2 setting for USCI0_DAT1      */
#define NUMAKER_SYS_GPD_MFPL_PD2MFP_SPI0_CLK        (0x4UL << NUMAKER_SYS_GPD_MFPL_PD2MFP_Pos)    /*!< GPD_MFPL PD2 setting for SPI0_CLK        */
#define NUMAKER_SYS_GPD_MFPL_PD2MFP_UART3_nCTS      (0x5UL << NUMAKER_SYS_GPD_MFPL_PD2MFP_Pos)    /*!< GPD_MFPL PD2 setting for UART3_nCTS      */
#define NUMAKER_SYS_GPD_MFPL_PD2MFP_SC2_RST         (0x7UL << NUMAKER_SYS_GPD_MFPL_PD2MFP_Pos)    /*!< GPD_MFPL PD2 setting for SC2_RST         */
#define NUMAKER_SYS_GPD_MFPL_PD2MFP_UART0_RXD       (0x9UL << NUMAKER_SYS_GPD_MFPL_PD2MFP_Pos)    /*!< GPD_MFPL PD2 setting for UART0_RXD       */
#define NUMAKER_SYS_GPD_MFPL_PD2MFP_LCD_SEG1        (0xFUL << NUMAKER_SYS_GPD_MFPL_PD2MFP_Pos)    /*!< GPD_MFPL PD2 setting for LCD_SEG1        */

/* PD.3 MFP */
#define NUMAKER_SYS_GPD_MFPL_PD3MFP_GPIO            (0x0UL << NUMAKER_SYS_GPD_MFPL_PD3MFP_Pos)    /*!< GPD_MFPL PD3 setting for GPIO            */
#define NUMAKER_SYS_GPD_MFPL_PD3MFP_EBI_AD10        (0x2UL << NUMAKER_SYS_GPD_MFPL_PD3MFP_Pos)    /*!< GPD_MFPL PD3 setting for EBI_AD10        */
#define NUMAKER_SYS_GPD_MFPL_PD3MFP_USCI0_CTL1      (0x3UL << NUMAKER_SYS_GPD_MFPL_PD3MFP_Pos)    /*!< GPD_MFPL PD3 setting for USCI0_CTL1      */
#define NUMAKER_SYS_GPD_MFPL_PD3MFP_SPI0_SS         (0x4UL << NUMAKER_SYS_GPD_MFPL_PD3MFP_Pos)    /*!< GPD_MFPL PD3 setting for SPI0_SS         */
#define NUMAKER_SYS_GPD_MFPL_PD3MFP_UART3_nRTS      (0x5UL << NUMAKER_SYS_GPD_MFPL_PD3MFP_Pos)    /*!< GPD_MFPL PD3 setting for UART3_nRTS      */
#define NUMAKER_SYS_GPD_MFPL_PD3MFP_USCI1_CTL0      (0x6UL << NUMAKER_SYS_GPD_MFPL_PD3MFP_Pos)    /*!< GPD_MFPL PD3 setting for USCI1_CTL0      */
#define NUMAKER_SYS_GPD_MFPL_PD3MFP_SC2_PWR         (0x7UL << NUMAKER_SYS_GPD_MFPL_PD3MFP_Pos)    /*!< GPD_MFPL PD3 setting for SC2_PWR         */
#define NUMAKER_SYS_GPD_MFPL_PD3MFP_SC1_nCD         (0x8UL << NUMAKER_SYS_GPD_MFPL_PD3MFP_Pos)    /*!< GPD_MFPL PD3 setting for SC1_nCD         */
#define NUMAKER_SYS_GPD_MFPL_PD3MFP_UART0_TXD       (0x9UL << NUMAKER_SYS_GPD_MFPL_PD3MFP_Pos)    /*!< GPD_MFPL PD3 setting for UART0_TXD       */
#define NUMAKER_SYS_GPD_MFPL_PD3MFP_LCD_SEG2        (0xFUL << NUMAKER_SYS_GPD_MFPL_PD3MFP_Pos)    /*!< GPD_MFPL PD3 setting for LCD_SEG2        */

/* PD.4 MFP */
#define NUMAKER_SYS_GPD_MFPL_PD4MFP_GPIO            (0x0UL << NUMAKER_SYS_GPD_MFPL_PD4MFP_Pos)    /*!< GPD_MFPL PD4 setting for GPIO            */
#define NUMAKER_SYS_GPD_MFPL_PD4MFP_USCI0_CTL0      (0x3UL << NUMAKER_SYS_GPD_MFPL_PD4MFP_Pos)    /*!< GPD_MFPL PD4 setting for USCI0_CTL0      */
#define NUMAKER_SYS_GPD_MFPL_PD4MFP_I2C1_SDA        (0x4UL << NUMAKER_SYS_GPD_MFPL_PD4MFP_Pos)    /*!< GPD_MFPL PD4 setting for I2C1_SDA        */
#define NUMAKER_SYS_GPD_MFPL_PD4MFP_SPI1_SS         (0x5UL << NUMAKER_SYS_GPD_MFPL_PD4MFP_Pos)    /*!< GPD_MFPL PD4 setting for SPI1_SS         */
#define NUMAKER_SYS_GPD_MFPL_PD4MFP_USCI1_CTL1      (0x6UL << NUMAKER_SYS_GPD_MFPL_PD4MFP_Pos)    /*!< GPD_MFPL PD4 setting for USCI1_CTL1      */
#define NUMAKER_SYS_GPD_MFPL_PD4MFP_SC1_CLK         (0x8UL << NUMAKER_SYS_GPD_MFPL_PD4MFP_Pos)    /*!< GPD_MFPL PD4 setting for SC1_CLK         */
#define NUMAKER_SYS_GPD_MFPL_PD4MFP_USB_VBUS_ST     (0xEUL << NUMAKER_SYS_GPD_MFPL_PD4MFP_Pos)    /*!< GPD_MFPL PD4 setting for USB_VBUS_ST     */

