baden/zephyr-soc-nuvoton-m2354/include/zephyr/dt-bindings/pinctrl/numaker-m2354-pinctrl.h
/* PD.5 MFP */
#define NUMAKER_SYS_GPD_MFPL_PD5MFP_GPIO            (0x0UL << NUMAKER_SYS_GPD_MFPL_PD5MFP_Pos)    /*!< GPD_MFPL PD5 setting for GPIO            */
#define NUMAKER_SYS_GPD_MFPL_PD5MFP_I2C1_SCL        (0x4UL << NUMAKER_SYS_GPD_MFPL_PD5MFP_Pos)    /*!< GPD_MFPL PD5 setting for I2C1_SCL        */
#define NUMAKER_SYS_GPD_MFPL_PD5MFP_SPI1_CLK        (0x5UL << NUMAKER_SYS_GPD_MFPL_PD5MFP_Pos)    /*!< GPD_MFPL PD5 setting for SPI1_CLK        */
#define NUMAKER_SYS_GPD_MFPL_PD5MFP_USCI1_DAT0      (0x6UL << NUMAKER_SYS_GPD_MFPL_PD5MFP_Pos)    /*!< GPD_MFPL PD5 setting for USCI1_DAT0      */
#define NUMAKER_SYS_GPD_MFPL_PD5MFP_SC1_DAT         (0x8UL << NUMAKER_SYS_GPD_MFPL_PD5MFP_Pos)    /*!< GPD_MFPL PD5 setting for SC1_DAT         */

/* PD.6 MFP */
#define NUMAKER_SYS_GPD_MFPL_PD6MFP_GPIO            (0x0UL << NUMAKER_SYS_GPD_MFPL_PD6MFP_Pos)    /*!< GPD_MFPL PD6 setting for GPIO            */
#define NUMAKER_SYS_GPD_MFPL_PD6MFP_UART1_RXD       (0x3UL << NUMAKER_SYS_GPD_MFPL_PD6MFP_Pos)    /*!< GPD_MFPL PD6 setting for UART1_RXD       */
#define NUMAKER_SYS_GPD_MFPL_PD6MFP_I2C0_SDA        (0x4UL << NUMAKER_SYS_GPD_MFPL_PD6MFP_Pos)    /*!< GPD_MFPL PD6 setting for I2C0_SDA        */
#define NUMAKER_SYS_GPD_MFPL_PD6MFP_SPI1_MOSI       (0x5UL << NUMAKER_SYS_GPD_MFPL_PD6MFP_Pos)    /*!< GPD_MFPL PD6 setting for SPI1_MOSI       */
#define NUMAKER_SYS_GPD_MFPL_PD6MFP_USCI1_DAT1      (0x6UL << NUMAKER_SYS_GPD_MFPL_PD6MFP_Pos)    /*!< GPD_MFPL PD6 setting for USCI1_DAT1      */
#define NUMAKER_SYS_GPD_MFPL_PD6MFP_SC1_RST         (0x8UL << NUMAKER_SYS_GPD_MFPL_PD6MFP_Pos)    /*!< GPD_MFPL PD6 setting for SC1_RST         */
#define NUMAKER_SYS_GPD_MFPL_PD6MFP_LCD_SEG13       (0xFUL << NUMAKER_SYS_GPD_MFPL_PD6MFP_Pos)    /*!< GPD_MFPL PD6 setting for LCD_SEG13       */

/* PD.7 MFP */
#define NUMAKER_SYS_GPD_MFPL_PD7MFP_GPIO            (0x0UL << NUMAKER_SYS_GPD_MFPL_PD7MFP_Pos)    /*!< GPD_MFPL PD7 setting for GPIO            */
#define NUMAKER_SYS_GPD_MFPL_PD7MFP_UART1_TXD       (0x3UL << NUMAKER_SYS_GPD_MFPL_PD7MFP_Pos)    /*!< GPD_MFPL PD7 setting for UART1_TXD       */
#define NUMAKER_SYS_GPD_MFPL_PD7MFP_I2C0_SCL        (0x4UL << NUMAKER_SYS_GPD_MFPL_PD7MFP_Pos)    /*!< GPD_MFPL PD7 setting for I2C0_SCL        */
#define NUMAKER_SYS_GPD_MFPL_PD7MFP_SPI1_MISO       (0x5UL << NUMAKER_SYS_GPD_MFPL_PD7MFP_Pos)    /*!< GPD_MFPL PD7 setting for SPI1_MISO       */
#define NUMAKER_SYS_GPD_MFPL_PD7MFP_USCI1_CLK       (0x6UL << NUMAKER_SYS_GPD_MFPL_PD7MFP_Pos)    /*!< GPD_MFPL PD7 setting for USCI1_CLK       */
#define NUMAKER_SYS_GPD_MFPL_PD7MFP_SC1_PWR         (0x8UL << NUMAKER_SYS_GPD_MFPL_PD7MFP_Pos)    /*!< GPD_MFPL PD7 setting for SC1_PWR         */
#define NUMAKER_SYS_GPD_MFPL_PD7MFP_LCD_SEG14       (0xFUL << NUMAKER_SYS_GPD_MFPL_PD7MFP_Pos)    /*!< GPD_MFPL PD7 setting for LCD_SEG14       */

/* PD.8 MFP */
#define NUMAKER_SYS_GPD_MFPH_PD8MFP_GPIO            (0x0UL << NUMAKER_SYS_GPD_MFPH_PD8MFP_Pos)    /*!< GPD_MFPH PD8 setting for GPIO            */
#define NUMAKER_SYS_GPD_MFPH_PD8MFP_EBI_AD6         (0x2UL << NUMAKER_SYS_GPD_MFPH_PD8MFP_Pos)    /*!< GPD_MFPH PD8 setting for EBI_AD6         */
#define NUMAKER_SYS_GPD_MFPH_PD8MFP_I2C2_SDA        (0x3UL << NUMAKER_SYS_GPD_MFPH_PD8MFP_Pos)    /*!< GPD_MFPH PD8 setting for I2C2_SDA        */
#define NUMAKER_SYS_GPD_MFPH_PD8MFP_UART2_nRTS      (0x4UL << NUMAKER_SYS_GPD_MFPH_PD8MFP_Pos)    /*!< GPD_MFPH PD8 setting for UART2_nRTS      */
#define NUMAKER_SYS_GPD_MFPH_PD8MFP_LCD_COM6        (0xFUL << NUMAKER_SYS_GPD_MFPH_PD8MFP_Pos)    /*!< GPD_MFPH PD8 setting for LCD_COM6        */
#define NUMAKER_SYS_GPD_MFPH_PD8MFP_LCD_SEG41       (0xFUL << NUMAKER_SYS_GPD_MFPH_PD8MFP_Pos)    /*!< GPD_MFPH PD8 setting for LCD_SEG41       */

/* PD.9 MFP */
#define NUMAKER_SYS_GPD_MFPH_PD9MFP_GPIO            (0x0UL << NUMAKER_SYS_GPD_MFPH_PD9MFP_Pos)    /*!< GPD_MFPH PD9 setting for GPIO            */
#define NUMAKER_SYS_GPD_MFPH_PD9MFP_EBI_AD7         (0x2UL << NUMAKER_SYS_GPD_MFPH_PD9MFP_Pos)    /*!< GPD_MFPH PD9 setting for EBI_AD7         */
#define NUMAKER_SYS_GPD_MFPH_PD9MFP_I2C2_SCL        (0x3UL << NUMAKER_SYS_GPD_MFPH_PD9MFP_Pos)    /*!< GPD_MFPH PD9 setting for I2C2_SCL        */
#define NUMAKER_SYS_GPD_MFPH_PD9MFP_UART2_nCTS      (0x4UL << NUMAKER_SYS_GPD_MFPH_PD9MFP_Pos)    /*!< GPD_MFPH PD9 setting for UART2_nCTS      */
#define NUMAKER_SYS_GPD_MFPH_PD9MFP_LCD_COM7        (0xFUL << NUMAKER_SYS_GPD_MFPH_PD9MFP_Pos)    /*!< GPD_MFPH PD9 setting for LCD_COM7        */
#define NUMAKER_SYS_GPD_MFPH_PD9MFP_LCD_SEG40       (0xFUL << NUMAKER_SYS_GPD_MFPH_PD9MFP_Pos)    /*!< GPD_MFPH PD9 setting for LCD_SEG40       */

/* PD.10 MFP */
#define NUMAKER_SYS_GPD_MFPH_PD10MFP_GPIO           (0x0UL << NUMAKER_SYS_GPD_MFPH_PD10MFP_Pos)   /*!< GPD_MFPH PD10 setting for GPIO           */
#define NUMAKER_SYS_GPD_MFPH_PD10MFP_EBI_nCS2       (0x2UL << NUMAKER_SYS_GPD_MFPH_PD10MFP_Pos)   /*!< GPD_MFPH PD10 setting for EBI_nCS2       */
#define NUMAKER_SYS_GPD_MFPH_PD10MFP_UART1_RXD      (0x3UL << NUMAKER_SYS_GPD_MFPH_PD10MFP_Pos)   /*!< GPD_MFPH PD10 setting for UART1_RXD      */
#define NUMAKER_SYS_GPD_MFPH_PD10MFP_CAN0_RXD       (0x4UL << NUMAKER_SYS_GPD_MFPH_PD10MFP_Pos)   /*!< GPD_MFPH PD10 setting for CAN0_RXD       */
#define NUMAKER_SYS_GPD_MFPH_PD10MFP_QEI0_B         (0xAUL << NUMAKER_SYS_GPD_MFPH_PD10MFP_Pos)   /*!< GPD_MFPH PD10 setting for QEI0_B         */
#define NUMAKER_SYS_GPD_MFPH_PD10MFP_INT7           (0xFUL << NUMAKER_SYS_GPD_MFPH_PD10MFP_Pos)   /*!< GPD_MFPH PD10 setting for INT7           */

/* PD.11 MFP */
#define NUMAKER_SYS_GPD_MFPH_PD11MFP_GPIO           (0x0UL << NUMAKER_SYS_GPD_MFPH_PD11MFP_Pos)   /*!< GPD_MFPH PD11 setting for GPIO           */
#define NUMAKER_SYS_GPD_MFPH_PD11MFP_EBI_nCS1       (0x2UL << NUMAKER_SYS_GPD_MFPH_PD11MFP_Pos)   /*!< GPD_MFPH PD11 setting for EBI_nCS1       */
#define NUMAKER_SYS_GPD_MFPH_PD11MFP_UART1_TXD      (0x3UL << NUMAKER_SYS_GPD_MFPH_PD11MFP_Pos)   /*!< GPD_MFPH PD11 setting for UART1_TXD      */
#define NUMAKER_SYS_GPD_MFPH_PD11MFP_CAN0_TXD       (0x4UL << NUMAKER_SYS_GPD_MFPH_PD11MFP_Pos)   /*!< GPD_MFPH PD11 setting for CAN0_TXD       */
#define NUMAKER_SYS_GPD_MFPH_PD11MFP_QEI0_A         (0xAUL << NUMAKER_SYS_GPD_MFPH_PD11MFP_Pos)   /*!< GPD_MFPH PD11 setting for QEI0_A         */
#define NUMAKER_SYS_GPD_MFPH_PD11MFP_INT6           (0xFUL << NUMAKER_SYS_GPD_MFPH_PD11MFP_Pos)   /*!< GPD_MFPH PD11 setting for INT6           */

/* PD.12 MFP */
#define NUMAKER_SYS_GPD_MFPH_PD12MFP_GPIO           (0x0UL << NUMAKER_SYS_GPD_MFPH_PD12MFP_Pos)   /*!< GPD_MFPH PD12 setting for GPIO           */
#define NUMAKER_SYS_GPD_MFPH_PD12MFP_EBI_nCS0       (0x2UL << NUMAKER_SYS_GPD_MFPH_PD12MFP_Pos)   /*!< GPD_MFPH PD12 setting for EBI_nCS0       */
#define NUMAKER_SYS_GPD_MFPH_PD12MFP_UART2_RXD      (0x7UL << NUMAKER_SYS_GPD_MFPH_PD12MFP_Pos)   /*!< GPD_MFPH PD12 setting for UART2_RXD      */
#define NUMAKER_SYS_GPD_MFPH_PD12MFP_BPWM0_CH5      (0x9UL << NUMAKER_SYS_GPD_MFPH_PD12MFP_Pos)   /*!< GPD_MFPH PD12 setting for BPWM0_CH5      */
#define NUMAKER_SYS_GPD_MFPH_PD12MFP_QEI0_INDEX     (0xAUL << NUMAKER_SYS_GPD_MFPH_PD12MFP_Pos)   /*!< GPD_MFPH PD12 setting for QEI0_INDEX     */
#define NUMAKER_SYS_GPD_MFPH_PD12MFP_CLKO           (0xDUL << NUMAKER_SYS_GPD_MFPH_PD12MFP_Pos)   /*!< GPD_MFPH PD12 setting for CLKO           */
#define NUMAKER_SYS_GPD_MFPH_PD12MFP_EADC0_ST       (0xEUL << NUMAKER_SYS_GPD_MFPH_PD12MFP_Pos)   /*!< GPD_MFPH PD12 setting for EADC0_ST       */
#define NUMAKER_SYS_GPD_MFPH_PD12MFP_INT5           (0xFUL << NUMAKER_SYS_GPD_MFPH_PD12MFP_Pos)   /*!< GPD_MFPH PD12 setting for INT5           */

/* PD.14 MFP */
#define NUMAKER_SYS_GPD_MFPH_PD14MFP_GPIO           (0x0UL << NUMAKER_SYS_GPD_MFPH_PD14MFP_Pos)   /*!< GPD_MFPH PD14 setting for GPIO           */
#define NUMAKER_SYS_GPD_MFPH_PD14MFP_EBI_nCS0       (0x2UL << NUMAKER_SYS_GPD_MFPH_PD14MFP_Pos)   /*!< GPD_MFPH PD14 setting for EBI_nCS0       */
#define NUMAKER_SYS_GPD_MFPH_PD14MFP_SPI3_I2SMCLK   (0x3UL << NUMAKER_SYS_GPD_MFPH_PD14MFP_Pos)   /*!< GPD_MFPH PD14 setting for SPI3_I2SMCLK   */
#define NUMAKER_SYS_GPD_MFPH_PD14MFP_SC1_nCD        (0x4UL << NUMAKER_SYS_GPD_MFPH_PD14MFP_Pos)   /*!< GPD_MFPH PD14 setting for SC1_nCD        */
#define NUMAKER_SYS_GPD_MFPH_PD14MFP_USCI0_CTL0     (0x5UL << NUMAKER_SYS_GPD_MFPH_PD14MFP_Pos)   /*!< GPD_MFPH PD14 setting for USCI0_CTL0     */
#define NUMAKER_SYS_GPD_MFPH_PD14MFP_SPI0_I2SMCLK   (0x6UL << NUMAKER_SYS_GPD_MFPH_PD14MFP_Pos)   /*!< GPD_MFPH PD14 setting for SPI0_I2SMCLK   */
#define NUMAKER_SYS_GPD_MFPH_PD14MFP_EPWM0_CH4      (0xBUL << NUMAKER_SYS_GPD_MFPH_PD14MFP_Pos)   /*!< GPD_MFPH PD14 setting for EPWM0_CH4      */
#define NUMAKER_SYS_GPD_MFPH_PD14MFP_LCD_SEG0       (0xFUL << NUMAKER_SYS_GPD_MFPH_PD14MFP_Pos)   /*!< GPD_MFPH PD14 setting for LCD_SEG0       */

/* PE.0 MFP */
#define NUMAKER_SYS_GPE_MFPL_PE0MFP_GPIO            (0x0UL << NUMAKER_SYS_GPE_MFPL_PE0MFP_Pos)    /*!< GPE_MFPL PE0 setting for GPIO            */
#define NUMAKER_SYS_GPE_MFPL_PE0MFP_EBI_AD11        (0x2UL << NUMAKER_SYS_GPE_MFPL_PE0MFP_Pos)    /*!< GPE_MFPL PE0 setting for EBI_AD11        */
#define NUMAKER_SYS_GPE_MFPL_PE0MFP_QSPI0_MOSI0     (0x3UL << NUMAKER_SYS_GPE_MFPL_PE0MFP_Pos)    /*!< GPE_MFPL PE0 setting for QSPI0_MOSI0     */
#define NUMAKER_SYS_GPE_MFPL_PE0MFP_SC2_CLK         (0x4UL << NUMAKER_SYS_GPE_MFPL_PE0MFP_Pos)    /*!< GPE_MFPL PE0 setting for SC2_CLK         */
#define NUMAKER_SYS_GPE_MFPL_PE0MFP_I2S0_MCLK       (0x5UL << NUMAKER_SYS_GPE_MFPL_PE0MFP_Pos)    /*!< GPE_MFPL PE0 setting for I2S0_MCLK       */
#define NUMAKER_SYS_GPE_MFPL_PE0MFP_SPI1_MOSI       (0x6UL << NUMAKER_SYS_GPE_MFPL_PE0MFP_Pos)    /*!< GPE_MFPL PE0 setting for SPI1_MOSI       */
#define NUMAKER_SYS_GPE_MFPL_PE0MFP_UART3_RXD       (0x7UL << NUMAKER_SYS_GPE_MFPL_PE0MFP_Pos)    /*!< GPE_MFPL PE0 setting for UART3_RXD       */
#define NUMAKER_SYS_GPE_MFPL_PE0MFP_I2C1_SDA        (0x8UL << NUMAKER_SYS_GPE_MFPL_PE0MFP_Pos)    /*!< GPE_MFPL PE0 setting for I2C1_SDA        */
#define NUMAKER_SYS_GPE_MFPL_PE0MFP_UART4_nRTS      (0x9UL << NUMAKER_SYS_GPE_MFPL_PE0MFP_Pos)    /*!< GPE_MFPL PE0 setting for UART4_nRTS      */
#define NUMAKER_SYS_GPE_MFPL_PE0MFP_LCD_SEG5        (0xFUL << NUMAKER_SYS_GPE_MFPL_PE0MFP_Pos)    /*!< GPE_MFPL PE0 setting for LCD_SEG5        */

