baden/zephyr-soc-nuvoton-m2354/include/zephyr/dt-bindings/pinctrl/numaker-m2354-pinctrl.h
/* PE.1 MFP */
#define NUMAKER_SYS_GPE_MFPL_PE1MFP_GPIO            (0x0UL << NUMAKER_SYS_GPE_MFPL_PE1MFP_Pos)    /*!< GPE_MFPL PE1 setting for GPIO            */
#define NUMAKER_SYS_GPE_MFPL_PE1MFP_EBI_AD10        (0x2UL << NUMAKER_SYS_GPE_MFPL_PE1MFP_Pos)    /*!< GPE_MFPL PE1 setting for EBI_AD10        */
#define NUMAKER_SYS_GPE_MFPL_PE1MFP_QSPI0_MISO0     (0x3UL << NUMAKER_SYS_GPE_MFPL_PE1MFP_Pos)    /*!< GPE_MFPL PE1 setting for QSPI0_MISO0     */
#define NUMAKER_SYS_GPE_MFPL_PE1MFP_SC2_DAT         (0x4UL << NUMAKER_SYS_GPE_MFPL_PE1MFP_Pos)    /*!< GPE_MFPL PE1 setting for SC2_DAT         */
#define NUMAKER_SYS_GPE_MFPL_PE1MFP_I2S0_BCLK       (0x5UL << NUMAKER_SYS_GPE_MFPL_PE1MFP_Pos)    /*!< GPE_MFPL PE1 setting for I2S0_BCLK       */
#define NUMAKER_SYS_GPE_MFPL_PE1MFP_SPI1_MISO       (0x6UL << NUMAKER_SYS_GPE_MFPL_PE1MFP_Pos)    /*!< GPE_MFPL PE1 setting for SPI1_MISO       */
#define NUMAKER_SYS_GPE_MFPL_PE1MFP_UART3_TXD       (0x7UL << NUMAKER_SYS_GPE_MFPL_PE1MFP_Pos)    /*!< GPE_MFPL PE1 setting for UART3_TXD       */
#define NUMAKER_SYS_GPE_MFPL_PE1MFP_I2C1_SCL        (0x8UL << NUMAKER_SYS_GPE_MFPL_PE1MFP_Pos)    /*!< GPE_MFPL PE1 setting for I2C1_SCL        */
#define NUMAKER_SYS_GPE_MFPL_PE1MFP_UART4_nCTS      (0x9UL << NUMAKER_SYS_GPE_MFPL_PE1MFP_Pos)    /*!< GPE_MFPL PE1 setting for UART4_nCTS      */
#define NUMAKER_SYS_GPE_MFPL_PE1MFP_LCD_SEG6        (0xFUL << NUMAKER_SYS_GPE_MFPL_PE1MFP_Pos)    /*!< GPE_MFPL PE1 setting for LCD_SEG6        */

/* PE.2 MFP */
#define NUMAKER_SYS_GPE_MFPL_PE2MFP_GPIO            (0x0UL << NUMAKER_SYS_GPE_MFPL_PE2MFP_Pos)    /*!< GPE_MFPL PE2 setting for GPIO            */
#define NUMAKER_SYS_GPE_MFPL_PE2MFP_EBI_ALE         (0x2UL << NUMAKER_SYS_GPE_MFPL_PE2MFP_Pos)    /*!< GPE_MFPL PE2 setting for EBI_ALE         */
#define NUMAKER_SYS_GPE_MFPL_PE2MFP_SD0_DAT0        (0x3UL << NUMAKER_SYS_GPE_MFPL_PE2MFP_Pos)    /*!< GPE_MFPL PE2 setting for SD0_DAT0        */
#define NUMAKER_SYS_GPE_MFPL_PE2MFP_SPI3_MOSI       (0x5UL << NUMAKER_SYS_GPE_MFPL_PE2MFP_Pos)    /*!< GPE_MFPL PE2 setting for SPI3_MOSI       */
#define NUMAKER_SYS_GPE_MFPL_PE2MFP_SC0_CLK         (0x6UL << NUMAKER_SYS_GPE_MFPL_PE2MFP_Pos)    /*!< GPE_MFPL PE2 setting for SC0_CLK         */
#define NUMAKER_SYS_GPE_MFPL_PE2MFP_USCI0_CLK       (0x7UL << NUMAKER_SYS_GPE_MFPL_PE2MFP_Pos)    /*!< GPE_MFPL PE2 setting for USCI0_CLK       */
#define NUMAKER_SYS_GPE_MFPL_PE2MFP_QEI0_B          (0xBUL << NUMAKER_SYS_GPE_MFPL_PE2MFP_Pos)    /*!< GPE_MFPL PE2 setting for QEI0_B          */
#define NUMAKER_SYS_GPE_MFPL_PE2MFP_EPWM0_CH5       (0xCUL << NUMAKER_SYS_GPE_MFPL_PE2MFP_Pos)    /*!< GPE_MFPL PE2 setting for EPWM0_CH5       */
#define NUMAKER_SYS_GPE_MFPL_PE2MFP_BPWM0_CH0       (0xDUL << NUMAKER_SYS_GPE_MFPL_PE2MFP_Pos)    /*!< GPE_MFPL PE2 setting for BPWM0_CH0       */
#define NUMAKER_SYS_GPE_MFPL_PE2MFP_LCD_SEG7        (0xFUL << NUMAKER_SYS_GPE_MFPL_PE2MFP_Pos)    /*!< GPE_MFPL PE2 setting for LCD_SEG7        */

/* PE.3 MFP */
#define NUMAKER_SYS_GPE_MFPL_PE3MFP_GPIO            (0x0UL << NUMAKER_SYS_GPE_MFPL_PE3MFP_Pos)    /*!< GPE_MFPL PE3 setting for GPIO            */
#define NUMAKER_SYS_GPE_MFPL_PE3MFP_EBI_MCLK        (0x2UL << NUMAKER_SYS_GPE_MFPL_PE3MFP_Pos)    /*!< GPE_MFPL PE3 setting for EBI_MCLK        */
#define NUMAKER_SYS_GPE_MFPL_PE3MFP_SD0_DAT1        (0x3UL << NUMAKER_SYS_GPE_MFPL_PE3MFP_Pos)    /*!< GPE_MFPL PE3 setting for SD0_DAT1        */
#define NUMAKER_SYS_GPE_MFPL_PE3MFP_SPI3_MISO       (0x5UL << NUMAKER_SYS_GPE_MFPL_PE3MFP_Pos)    /*!< GPE_MFPL PE3 setting for SPI3_MISO       */
#define NUMAKER_SYS_GPE_MFPL_PE3MFP_SC0_DAT         (0x6UL << NUMAKER_SYS_GPE_MFPL_PE3MFP_Pos)    /*!< GPE_MFPL PE3 setting for SC0_DAT         */
#define NUMAKER_SYS_GPE_MFPL_PE3MFP_USCI0_DAT0      (0x7UL << NUMAKER_SYS_GPE_MFPL_PE3MFP_Pos)    /*!< GPE_MFPL PE3 setting for USCI0_DAT0      */
#define NUMAKER_SYS_GPE_MFPL_PE3MFP_QEI0_A          (0xBUL << NUMAKER_SYS_GPE_MFPL_PE3MFP_Pos)    /*!< GPE_MFPL PE3 setting for QEI0_A          */
#define NUMAKER_SYS_GPE_MFPL_PE3MFP_EPWM0_CH4       (0xCUL << NUMAKER_SYS_GPE_MFPL_PE3MFP_Pos)    /*!< GPE_MFPL PE3 setting for EPWM0_CH4       */
#define NUMAKER_SYS_GPE_MFPL_PE3MFP_BPWM0_CH1       (0xDUL << NUMAKER_SYS_GPE_MFPL_PE3MFP_Pos)    /*!< GPE_MFPL PE3 setting for BPWM0_CH1       */
#define NUMAKER_SYS_GPE_MFPL_PE3MFP_LCD_SEG8        (0xFUL << NUMAKER_SYS_GPE_MFPL_PE3MFP_Pos)    /*!< GPE_MFPL PE3 setting for LCD_SEG8        */

/* PE.4 MFP */
#define NUMAKER_SYS_GPE_MFPL_PE4MFP_GPIO            (0x0UL << NUMAKER_SYS_GPE_MFPL_PE4MFP_Pos)    /*!< GPE_MFPL PE4 setting for GPIO            */
#define NUMAKER_SYS_GPE_MFPL_PE4MFP_EBI_nWR         (0x2UL << NUMAKER_SYS_GPE_MFPL_PE4MFP_Pos)    /*!< GPE_MFPL PE4 setting for EBI_nWR         */
#define NUMAKER_SYS_GPE_MFPL_PE4MFP_SD0_DAT2        (0x3UL << NUMAKER_SYS_GPE_MFPL_PE4MFP_Pos)    /*!< GPE_MFPL PE4 setting for SD0_DAT2        */
#define NUMAKER_SYS_GPE_MFPL_PE4MFP_SPI3_CLK        (0x5UL << NUMAKER_SYS_GPE_MFPL_PE4MFP_Pos)    /*!< GPE_MFPL PE4 setting for SPI3_CLK        */
#define NUMAKER_SYS_GPE_MFPL_PE4MFP_SC0_RST         (0x6UL << NUMAKER_SYS_GPE_MFPL_PE4MFP_Pos)    /*!< GPE_MFPL PE4 setting for SC0_RST         */
#define NUMAKER_SYS_GPE_MFPL_PE4MFP_USCI0_DAT1      (0x7UL << NUMAKER_SYS_GPE_MFPL_PE4MFP_Pos)    /*!< GPE_MFPL PE4 setting for USCI0_DAT1      */
#define NUMAKER_SYS_GPE_MFPL_PE4MFP_QEI0_INDEX      (0xBUL << NUMAKER_SYS_GPE_MFPL_PE4MFP_Pos)    /*!< GPE_MFPL PE4 setting for QEI0_INDEX      */
#define NUMAKER_SYS_GPE_MFPL_PE4MFP_EPWM0_CH3       (0xCUL << NUMAKER_SYS_GPE_MFPL_PE4MFP_Pos)    /*!< GPE_MFPL PE4 setting for EPWM0_CH3       */
#define NUMAKER_SYS_GPE_MFPL_PE4MFP_BPWM0_CH2       (0xDUL << NUMAKER_SYS_GPE_MFPL_PE4MFP_Pos)    /*!< GPE_MFPL PE4 setting for BPWM0_CH2       */
#define NUMAKER_SYS_GPE_MFPL_PE4MFP_LCD_SEG9        (0xFUL << NUMAKER_SYS_GPE_MFPL_PE4MFP_Pos)    /*!< GPE_MFPL PE4 setting for LCD_SEG9        */

/* PE.5 MFP */
#define NUMAKER_SYS_GPE_MFPL_PE5MFP_GPIO            (0x0UL << NUMAKER_SYS_GPE_MFPL_PE5MFP_Pos)    /*!< GPE_MFPL PE5 setting for GPIO            */
#define NUMAKER_SYS_GPE_MFPL_PE5MFP_EBI_nRD         (0x2UL << NUMAKER_SYS_GPE_MFPL_PE5MFP_Pos)    /*!< GPE_MFPL PE5 setting for EBI_nRD         */
#define NUMAKER_SYS_GPE_MFPL_PE5MFP_SD0_DAT3        (0x3UL << NUMAKER_SYS_GPE_MFPL_PE5MFP_Pos)    /*!< GPE_MFPL PE5 setting for SD0_DAT3        */
#define NUMAKER_SYS_GPE_MFPL_PE5MFP_SPI3_SS         (0x5UL << NUMAKER_SYS_GPE_MFPL_PE5MFP_Pos)    /*!< GPE_MFPL PE5 setting for SPI3_SS         */
#define NUMAKER_SYS_GPE_MFPL_PE5MFP_SC0_PWR         (0x6UL << NUMAKER_SYS_GPE_MFPL_PE5MFP_Pos)    /*!< GPE_MFPL PE5 setting for SC0_PWR         */
#define NUMAKER_SYS_GPE_MFPL_PE5MFP_USCI0_CTL1      (0x7UL << NUMAKER_SYS_GPE_MFPL_PE5MFP_Pos)    /*!< GPE_MFPL PE5 setting for USCI0_CTL1      */
#define NUMAKER_SYS_GPE_MFPL_PE5MFP_QEI1_B          (0xBUL << NUMAKER_SYS_GPE_MFPL_PE5MFP_Pos)    /*!< GPE_MFPL PE5 setting for QEI1_B          */
#define NUMAKER_SYS_GPE_MFPL_PE5MFP_EPWM0_CH2       (0xCUL << NUMAKER_SYS_GPE_MFPL_PE5MFP_Pos)    /*!< GPE_MFPL PE5 setting for EPWM0_CH2       */
#define NUMAKER_SYS_GPE_MFPL_PE5MFP_BPWM0_CH3       (0xDUL << NUMAKER_SYS_GPE_MFPL_PE5MFP_Pos)    /*!< GPE_MFPL PE5 setting for BPWM0_CH3       */
#define NUMAKER_SYS_GPE_MFPL_PE5MFP_LCD_SEG10       (0xFUL << NUMAKER_SYS_GPE_MFPL_PE5MFP_Pos)    /*!< GPE_MFPL PE5 setting for LCD_SEG10       */

/* PE.6 MFP */
#define NUMAKER_SYS_GPE_MFPL_PE6MFP_GPIO            (0x0UL << NUMAKER_SYS_GPE_MFPL_PE6MFP_Pos)    /*!< GPE_MFPL PE6 setting for GPIO            */
#define NUMAKER_SYS_GPE_MFPL_PE6MFP_SD0_CLK         (0x3UL << NUMAKER_SYS_GPE_MFPL_PE6MFP_Pos)    /*!< GPE_MFPL PE6 setting for SD0_CLK         */
#define NUMAKER_SYS_GPE_MFPL_PE6MFP_SPI3_I2SMCLK    (0x5UL << NUMAKER_SYS_GPE_MFPL_PE6MFP_Pos)    /*!< GPE_MFPL PE6 setting for SPI3_I2SMCLK    */
#define NUMAKER_SYS_GPE_MFPL_PE6MFP_SC0_nCD         (0x6UL << NUMAKER_SYS_GPE_MFPL_PE6MFP_Pos)    /*!< GPE_MFPL PE6 setting for SC0_nCD         */
#define NUMAKER_SYS_GPE_MFPL_PE6MFP_USCI0_CTL0      (0x7UL << NUMAKER_SYS_GPE_MFPL_PE6MFP_Pos)    /*!< GPE_MFPL PE6 setting for USCI0_CTL0      */
#define NUMAKER_SYS_GPE_MFPL_PE6MFP_UART5_RXD       (0x8UL << NUMAKER_SYS_GPE_MFPL_PE6MFP_Pos)    /*!< GPE_MFPL PE6 setting for UART5_RXD       */
#define NUMAKER_SYS_GPE_MFPL_PE6MFP_QEI1_A          (0xBUL << NUMAKER_SYS_GPE_MFPL_PE6MFP_Pos)    /*!< GPE_MFPL PE6 setting for QEI1_A          */
#define NUMAKER_SYS_GPE_MFPL_PE6MFP_EPWM0_CH1       (0xCUL << NUMAKER_SYS_GPE_MFPL_PE6MFP_Pos)    /*!< GPE_MFPL PE6 setting for EPWM0_CH1       */
#define NUMAKER_SYS_GPE_MFPL_PE6MFP_BPWM0_CH4       (0xDUL << NUMAKER_SYS_GPE_MFPL_PE6MFP_Pos)    /*!< GPE_MFPL PE6 setting for BPWM0_CH4       */
#define NUMAKER_SYS_GPE_MFPL_PE6MFP_LCD_SEG11       (0xFUL << NUMAKER_SYS_GPE_MFPL_PE6MFP_Pos)    /*!< GPE_MFPL PE6 setting for LCD_SEG11       */

/* PE.7 MFP */
#define NUMAKER_SYS_GPE_MFPL_PE7MFP_GPIO            (0x0UL << NUMAKER_SYS_GPE_MFPL_PE7MFP_Pos)    /*!< GPE_MFPL PE7 setting for GPIO            */
#define NUMAKER_SYS_GPE_MFPL_PE7MFP_SD0_CMD         (0x3UL << NUMAKER_SYS_GPE_MFPL_PE7MFP_Pos)    /*!< GPE_MFPL PE7 setting for SD0_CMD         */
#define NUMAKER_SYS_GPE_MFPL_PE7MFP_UART5_TXD       (0x8UL << NUMAKER_SYS_GPE_MFPL_PE7MFP_Pos)    /*!< GPE_MFPL PE7 setting for UART5_TXD       */
#define NUMAKER_SYS_GPE_MFPL_PE7MFP_QEI1_INDEX      (0xBUL << NUMAKER_SYS_GPE_MFPL_PE7MFP_Pos)    /*!< GPE_MFPL PE7 setting for QEI1_INDEX      */
#define NUMAKER_SYS_GPE_MFPL_PE7MFP_EPWM0_CH0       (0xCUL << NUMAKER_SYS_GPE_MFPL_PE7MFP_Pos)    /*!< GPE_MFPL PE7 setting for EPWM0_CH0       */
#define NUMAKER_SYS_GPE_MFPL_PE7MFP_BPWM0_CH5       (0xDUL << NUMAKER_SYS_GPE_MFPL_PE7MFP_Pos)    /*!< GPE_MFPL PE7 setting for BPWM0_CH5       */
#define NUMAKER_SYS_GPE_MFPL_PE7MFP_LCD_SEG12       (0xFUL << NUMAKER_SYS_GPE_MFPL_PE7MFP_Pos)    /*!< GPE_MFPL PE7 setting for LCD_SEG12       */

/* PE.8 MFP */
#define NUMAKER_SYS_GPE_MFPH_PE8MFP_GPIO            (0x0UL << NUMAKER_SYS_GPE_MFPH_PE8MFP_Pos)    /*!< GPE_MFPH PE8 setting for GPIO            */
#define NUMAKER_SYS_GPE_MFPH_PE8MFP_EBI_ADR10       (0x2UL << NUMAKER_SYS_GPE_MFPH_PE8MFP_Pos)    /*!< GPE_MFPH PE8 setting for EBI_ADR10       */
#define NUMAKER_SYS_GPE_MFPH_PE8MFP_I2S0_BCLK       (0x4UL << NUMAKER_SYS_GPE_MFPH_PE8MFP_Pos)    /*!< GPE_MFPH PE8 setting for I2S0_BCLK       */
#define NUMAKER_SYS_GPE_MFPH_PE8MFP_SPI2_CLK        (0x5UL << NUMAKER_SYS_GPE_MFPH_PE8MFP_Pos)    /*!< GPE_MFPH PE8 setting for SPI2_CLK        */
#define NUMAKER_SYS_GPE_MFPH_PE8MFP_USCI1_CTL1      (0x6UL << NUMAKER_SYS_GPE_MFPH_PE8MFP_Pos)    /*!< GPE_MFPH PE8 setting for USCI1_CTL1      */
#define NUMAKER_SYS_GPE_MFPH_PE8MFP_UART2_TXD       (0x7UL << NUMAKER_SYS_GPE_MFPH_PE8MFP_Pos)    /*!< GPE_MFPH PE8 setting for UART2_TXD       */
#define NUMAKER_SYS_GPE_MFPH_PE8MFP_EPWM0_CH0       (0xAUL << NUMAKER_SYS_GPE_MFPH_PE8MFP_Pos)    /*!< GPE_MFPH PE8 setting for EPWM0_CH0       */
#define NUMAKER_SYS_GPE_MFPH_PE8MFP_EPWM0_BRAKE0    (0xBUL << NUMAKER_SYS_GPE_MFPH_PE8MFP_Pos)    /*!< GPE_MFPH PE8 setting for EPWM0_BRAKE0    */
#define NUMAKER_SYS_GPE_MFPH_PE8MFP_ECAP0_IC0       (0xCUL << NUMAKER_SYS_GPE_MFPH_PE8MFP_Pos)    /*!< GPE_MFPH PE8 setting for ECAP0_IC0       */
#define NUMAKER_SYS_GPE_MFPH_PE8MFP_TRACE_DATA3     (0xEUL << NUMAKER_SYS_GPE_MFPH_PE8MFP_Pos)    /*!< GPE_MFPH PE8 setting for TRACE_DATA3     */
#define NUMAKER_SYS_GPE_MFPH_PE8MFP_LCD_SEG32       (0xFUL << NUMAKER_SYS_GPE_MFPH_PE8MFP_Pos)    /*!< GPE_MFPH PE8 setting for LCD_SEG32       */

/* PE.9 MFP */
#define NUMAKER_SYS_GPE_MFPH_PE9MFP_GPIO            (0x0UL << NUMAKER_SYS_GPE_MFPH_PE9MFP_Pos)    /*!< GPE_MFPH PE9 setting for GPIO            */
#define NUMAKER_SYS_GPE_MFPH_PE9MFP_EBI_ADR11       (0x2UL << NUMAKER_SYS_GPE_MFPH_PE9MFP_Pos)    /*!< GPE_MFPH PE9 setting for EBI_ADR11       */
#define NUMAKER_SYS_GPE_MFPH_PE9MFP_I2S0_MCLK       (0x4UL << NUMAKER_SYS_GPE_MFPH_PE9MFP_Pos)    /*!< GPE_MFPH PE9 setting for I2S0_MCLK       */
#define NUMAKER_SYS_GPE_MFPH_PE9MFP_SPI2_MISO       (0x5UL << NUMAKER_SYS_GPE_MFPH_PE9MFP_Pos)    /*!< GPE_MFPH PE9 setting for SPI2_MISO       */
#define NUMAKER_SYS_GPE_MFPH_PE9MFP_USCI1_CTL0      (0x6UL << NUMAKER_SYS_GPE_MFPH_PE9MFP_Pos)    /*!< GPE_MFPH PE9 setting for USCI1_CTL0      */
#define NUMAKER_SYS_GPE_MFPH_PE9MFP_UART2_RXD       (0x7UL << NUMAKER_SYS_GPE_MFPH_PE9MFP_Pos)    /*!< GPE_MFPH PE9 setting for UART2_RXD       */
#define NUMAKER_SYS_GPE_MFPH_PE9MFP_EPWM0_CH1       (0xAUL << NUMAKER_SYS_GPE_MFPH_PE9MFP_Pos)    /*!< GPE_MFPH PE9 setting for EPWM0_CH1       */
#define NUMAKER_SYS_GPE_MFPH_PE9MFP_EPWM0_BRAKE1    (0xBUL << NUMAKER_SYS_GPE_MFPH_PE9MFP_Pos)    /*!< GPE_MFPH PE9 setting for EPWM0_BRAKE1    */
#define NUMAKER_SYS_GPE_MFPH_PE9MFP_ECAP0_IC1       (0xCUL << NUMAKER_SYS_GPE_MFPH_PE9MFP_Pos)    /*!< GPE_MFPH PE9 setting for ECAP0_IC1       */
#define NUMAKER_SYS_GPE_MFPH_PE9MFP_TRACE_DATA2     (0xEUL << NUMAKER_SYS_GPE_MFPH_PE9MFP_Pos)    /*!< GPE_MFPH PE9 setting for TRACE_DATA2     */
#define NUMAKER_SYS_GPE_MFPH_PE9MFP_LCD_SEG31       (0xFUL << NUMAKER_SYS_GPE_MFPH_PE9MFP_Pos)    /*!< GPE_MFPH PE9 setting for LCD_SEG31       */

