baden/zephyr-soc-nuvoton-m2354/include/zephyr/dt-bindings/pinctrl/numaker-m2354-pinctrl.h
/* PE.10 MFP */
#define NUMAKER_SYS_GPE_MFPH_PE10MFP_GPIO           (0x0UL << NUMAKER_SYS_GPE_MFPH_PE10MFP_Pos)   /*!< GPE_MFPH PE10 setting for GPIO           */
#define NUMAKER_SYS_GPE_MFPH_PE10MFP_EBI_ADR12      (0x2UL << NUMAKER_SYS_GPE_MFPH_PE10MFP_Pos)   /*!< GPE_MFPH PE10 setting for EBI_ADR12      */
#define NUMAKER_SYS_GPE_MFPH_PE10MFP_I2S0_DI        (0x4UL << NUMAKER_SYS_GPE_MFPH_PE10MFP_Pos)   /*!< GPE_MFPH PE10 setting for I2S0_DI        */
#define NUMAKER_SYS_GPE_MFPH_PE10MFP_SPI2_MOSI      (0x5UL << NUMAKER_SYS_GPE_MFPH_PE10MFP_Pos)   /*!< GPE_MFPH PE10 setting for SPI2_MOSI      */
#define NUMAKER_SYS_GPE_MFPH_PE10MFP_USCI1_DAT0     (0x6UL << NUMAKER_SYS_GPE_MFPH_PE10MFP_Pos)   /*!< GPE_MFPH PE10 setting for USCI1_DAT0     */
#define NUMAKER_SYS_GPE_MFPH_PE10MFP_UART3_TXD      (0x7UL << NUMAKER_SYS_GPE_MFPH_PE10MFP_Pos)   /*!< GPE_MFPH PE10 setting for UART3_TXD      */
#define NUMAKER_SYS_GPE_MFPH_PE10MFP_EPWM0_CH2      (0xAUL << NUMAKER_SYS_GPE_MFPH_PE10MFP_Pos)   /*!< GPE_MFPH PE10 setting for EPWM0_CH2      */
#define NUMAKER_SYS_GPE_MFPH_PE10MFP_EPWM1_BRAKE0   (0xBUL << NUMAKER_SYS_GPE_MFPH_PE10MFP_Pos)   /*!< GPE_MFPH PE10 setting for EPWM1_BRAKE0   */
#define NUMAKER_SYS_GPE_MFPH_PE10MFP_ECAP0_IC2      (0xCUL << NUMAKER_SYS_GPE_MFPH_PE10MFP_Pos)   /*!< GPE_MFPH PE10 setting for ECAP0_IC2      */
#define NUMAKER_SYS_GPE_MFPH_PE10MFP_TRACE_DATA1    (0xEUL << NUMAKER_SYS_GPE_MFPH_PE10MFP_Pos)   /*!< GPE_MFPH PE10 setting for TRACE_DATA1    */
#define NUMAKER_SYS_GPE_MFPH_PE10MFP_LCD_SEG30      (0xFUL << NUMAKER_SYS_GPE_MFPH_PE10MFP_Pos)   /*!< GPE_MFPH PE10 setting for LCD_SEG30      */

/* PE.11 MFP */
#define NUMAKER_SYS_GPE_MFPH_PE11MFP_GPIO           (0x0UL << NUMAKER_SYS_GPE_MFPH_PE11MFP_Pos)   /*!< GPE_MFPH PE11 setting for GPIO           */
#define NUMAKER_SYS_GPE_MFPH_PE11MFP_EBI_ADR13      (0x2UL << NUMAKER_SYS_GPE_MFPH_PE11MFP_Pos)   /*!< GPE_MFPH PE11 setting for EBI_ADR13      */
#define NUMAKER_SYS_GPE_MFPH_PE11MFP_I2S0_DO        (0x4UL << NUMAKER_SYS_GPE_MFPH_PE11MFP_Pos)   /*!< GPE_MFPH PE11 setting for I2S0_DO        */
#define NUMAKER_SYS_GPE_MFPH_PE11MFP_SPI2_SS        (0x5UL << NUMAKER_SYS_GPE_MFPH_PE11MFP_Pos)   /*!< GPE_MFPH PE11 setting for SPI2_SS        */
#define NUMAKER_SYS_GPE_MFPH_PE11MFP_USCI1_DAT1     (0x6UL << NUMAKER_SYS_GPE_MFPH_PE11MFP_Pos)   /*!< GPE_MFPH PE11 setting for USCI1_DAT1     */
#define NUMAKER_SYS_GPE_MFPH_PE11MFP_UART3_RXD      (0x7UL << NUMAKER_SYS_GPE_MFPH_PE11MFP_Pos)   /*!< GPE_MFPH PE11 setting for UART3_RXD      */
#define NUMAKER_SYS_GPE_MFPH_PE11MFP_UART1_nCTS     (0x8UL << NUMAKER_SYS_GPE_MFPH_PE11MFP_Pos)   /*!< GPE_MFPH PE11 setting for UART1_nCTS     */
#define NUMAKER_SYS_GPE_MFPH_PE11MFP_EPWM0_CH3      (0xAUL << NUMAKER_SYS_GPE_MFPH_PE11MFP_Pos)   /*!< GPE_MFPH PE11 setting for EPWM0_CH3      */
#define NUMAKER_SYS_GPE_MFPH_PE11MFP_EPWM1_BRAKE1   (0xBUL << NUMAKER_SYS_GPE_MFPH_PE11MFP_Pos)   /*!< GPE_MFPH PE11 setting for EPWM1_BRAKE1   */
#define NUMAKER_SYS_GPE_MFPH_PE11MFP_ECAP1_IC2      (0xDUL << NUMAKER_SYS_GPE_MFPH_PE11MFP_Pos)   /*!< GPE_MFPH PE11 setting for ECAP1_IC2      */
#define NUMAKER_SYS_GPE_MFPH_PE11MFP_TRACE_DATA0    (0xEUL << NUMAKER_SYS_GPE_MFPH_PE11MFP_Pos)   /*!< GPE_MFPH PE11 setting for TRACE_DATA0    */

/* PE.12 MFP */
#define NUMAKER_SYS_GPE_MFPH_PE12MFP_GPIO           (0x0UL << NUMAKER_SYS_GPE_MFPH_PE12MFP_Pos)   /*!< GPE_MFPH PE12 setting for GPIO           */
#define NUMAKER_SYS_GPE_MFPH_PE12MFP_EBI_ADR14      (0x2UL << NUMAKER_SYS_GPE_MFPH_PE12MFP_Pos)   /*!< GPE_MFPH PE12 setting for EBI_ADR14      */
#define NUMAKER_SYS_GPE_MFPH_PE12MFP_I2S0_LRCK      (0x4UL << NUMAKER_SYS_GPE_MFPH_PE12MFP_Pos)   /*!< GPE_MFPH PE12 setting for I2S0_LRCK      */
#define NUMAKER_SYS_GPE_MFPH_PE12MFP_SPI2_I2SMCLK   (0x5UL << NUMAKER_SYS_GPE_MFPH_PE12MFP_Pos)   /*!< GPE_MFPH PE12 setting for SPI2_I2SMCLK   */
#define NUMAKER_SYS_GPE_MFPH_PE12MFP_USCI1_CLK      (0x6UL << NUMAKER_SYS_GPE_MFPH_PE12MFP_Pos)   /*!< GPE_MFPH PE12 setting for USCI1_CLK      */
#define NUMAKER_SYS_GPE_MFPH_PE12MFP_UART1_nRTS     (0x8UL << NUMAKER_SYS_GPE_MFPH_PE12MFP_Pos)   /*!< GPE_MFPH PE12 setting for UART1_nRTS     */
#define NUMAKER_SYS_GPE_MFPH_PE12MFP_EPWM0_CH4      (0xAUL << NUMAKER_SYS_GPE_MFPH_PE12MFP_Pos)   /*!< GPE_MFPH PE12 setting for EPWM0_CH4      */
#define NUMAKER_SYS_GPE_MFPH_PE12MFP_ECAP1_IC1      (0xDUL << NUMAKER_SYS_GPE_MFPH_PE12MFP_Pos)   /*!< GPE_MFPH PE12 setting for ECAP1_IC1      */
#define NUMAKER_SYS_GPE_MFPH_PE12MFP_TRACE_CLK      (0xEUL << NUMAKER_SYS_GPE_MFPH_PE12MFP_Pos)   /*!< GPE_MFPH PE12 setting for TRACE_CLK      */

/* PE.13 MFP */
#define NUMAKER_SYS_GPE_MFPH_PE13MFP_GPIO           (0x0UL << NUMAKER_SYS_GPE_MFPH_PE13MFP_Pos)   /*!< GPE_MFPH PE13 setting for GPIO           */
#define NUMAKER_SYS_GPE_MFPH_PE13MFP_EBI_ADR15      (0x2UL << NUMAKER_SYS_GPE_MFPH_PE13MFP_Pos)   /*!< GPE_MFPH PE13 setting for EBI_ADR15      */
#define NUMAKER_SYS_GPE_MFPH_PE13MFP_I2C0_SCL       (0x4UL << NUMAKER_SYS_GPE_MFPH_PE13MFP_Pos)   /*!< GPE_MFPH PE13 setting for I2C0_SCL       */
#define NUMAKER_SYS_GPE_MFPH_PE13MFP_UART4_nRTS     (0x5UL << NUMAKER_SYS_GPE_MFPH_PE13MFP_Pos)   /*!< GPE_MFPH PE13 setting for UART4_nRTS     */
#define NUMAKER_SYS_GPE_MFPH_PE13MFP_UART1_TXD      (0x8UL << NUMAKER_SYS_GPE_MFPH_PE13MFP_Pos)   /*!< GPE_MFPH PE13 setting for UART1_TXD      */
#define NUMAKER_SYS_GPE_MFPH_PE13MFP_EPWM0_CH5      (0xAUL << NUMAKER_SYS_GPE_MFPH_PE13MFP_Pos)   /*!< GPE_MFPH PE13 setting for EPWM0_CH5      */
#define NUMAKER_SYS_GPE_MFPH_PE13MFP_EPWM1_CH0      (0xBUL << NUMAKER_SYS_GPE_MFPH_PE13MFP_Pos)   /*!< GPE_MFPH PE13 setting for EPWM1_CH0      */
#define NUMAKER_SYS_GPE_MFPH_PE13MFP_BPWM1_CH5      (0xCUL << NUMAKER_SYS_GPE_MFPH_PE13MFP_Pos)   /*!< GPE_MFPH PE13 setting for BPWM1_CH5      */
#define NUMAKER_SYS_GPE_MFPH_PE13MFP_ECAP1_IC0      (0xDUL << NUMAKER_SYS_GPE_MFPH_PE13MFP_Pos)   /*!< GPE_MFPH PE13 setting for ECAP1_IC0      */

/* PE.14 MFP */
#define NUMAKER_SYS_GPE_MFPH_PE14MFP_GPIO           (0x0UL << NUMAKER_SYS_GPE_MFPH_PE14MFP_Pos)   /*!< GPE_MFPH PE14 setting for GPIO           */
#define NUMAKER_SYS_GPE_MFPH_PE14MFP_EBI_AD8        (0x2UL << NUMAKER_SYS_GPE_MFPH_PE14MFP_Pos)   /*!< GPE_MFPH PE14 setting for EBI_AD8        */
#define NUMAKER_SYS_GPE_MFPH_PE14MFP_UART2_TXD      (0x3UL << NUMAKER_SYS_GPE_MFPH_PE14MFP_Pos)   /*!< GPE_MFPH PE14 setting for UART2_TXD      */
#define NUMAKER_SYS_GPE_MFPH_PE14MFP_CAN0_TXD       (0x4UL << NUMAKER_SYS_GPE_MFPH_PE14MFP_Pos)   /*!< GPE_MFPH PE14 setting for CAN0_TXD       */
#define NUMAKER_SYS_GPE_MFPH_PE14MFP_LCD_SEG23      (0xFUL << NUMAKER_SYS_GPE_MFPH_PE14MFP_Pos)   /*!< GPE_MFPH PE14 setting for LCD_SEG23      */

