baden/zephyr-soc-nuvoton-m2354/include/zephyr/dt-bindings/pinctrl/numaker-m2354-pinctrl.h
/* PE.15 MFP */
#define NUMAKER_SYS_GPE_MFPH_PE15MFP_GPIO           (0x0UL << NUMAKER_SYS_GPE_MFPH_PE15MFP_Pos)   /*!< GPE_MFPH PE15 setting for GPIO           */
#define NUMAKER_SYS_GPE_MFPH_PE15MFP_EBI_AD9        (0x2UL << NUMAKER_SYS_GPE_MFPH_PE15MFP_Pos)   /*!< GPE_MFPH PE15 setting for EBI_AD9        */
#define NUMAKER_SYS_GPE_MFPH_PE15MFP_UART2_RXD      (0x3UL << NUMAKER_SYS_GPE_MFPH_PE15MFP_Pos)   /*!< GPE_MFPH PE15 setting for UART2_RXD      */
#define NUMAKER_SYS_GPE_MFPH_PE15MFP_CAN0_RXD       (0x4UL << NUMAKER_SYS_GPE_MFPH_PE15MFP_Pos)   /*!< GPE_MFPH PE15 setting for CAN0_RXD       */
#define NUMAKER_SYS_GPE_MFPH_PE15MFP_LCD_SEG22      (0xFUL << NUMAKER_SYS_GPE_MFPH_PE15MFP_Pos)   /*!< GPE_MFPH PE15 setting for LCD_SEG22      */

/* PF.0 MFP */
#define NUMAKER_SYS_GPF_MFPL_PF0MFP_GPIO            (0x0UL << NUMAKER_SYS_GPF_MFPL_PF0MFP_Pos)    /*!< GPF_MFPL PF0 setting for GPIO            */
#define NUMAKER_SYS_GPF_MFPL_PF0MFP_UART1_TXD       (0x2UL << NUMAKER_SYS_GPF_MFPL_PF0MFP_Pos)    /*!< GPF_MFPL PF0 setting for UART1_TXD       */
#define NUMAKER_SYS_GPF_MFPL_PF0MFP_I2C1_SCL        (0x3UL << NUMAKER_SYS_GPF_MFPL_PF0MFP_Pos)    /*!< GPF_MFPL PF0 setting for I2C1_SCL        */
#define NUMAKER_SYS_GPF_MFPL_PF0MFP_UART0_TXD       (0x4UL << NUMAKER_SYS_GPF_MFPL_PF0MFP_Pos)    /*!< GPF_MFPL PF0 setting for UART0_TXD       */
#define NUMAKER_SYS_GPF_MFPL_PF0MFP_BPWM1_CH0       (0xCUL << NUMAKER_SYS_GPF_MFPL_PF0MFP_Pos)    /*!< GPF_MFPL PF0 setting for BPWM1_CH0       */
#define NUMAKER_SYS_GPF_MFPL_PF0MFP_ICE_DAT         (0xEUL << NUMAKER_SYS_GPF_MFPL_PF0MFP_Pos)    /*!< GPF_MFPL PF0 setting for ICE_DAT         */

/* PF.1 MFP */
#define NUMAKER_SYS_GPF_MFPL_PF1MFP_GPIO            (0x0UL << NUMAKER_SYS_GPF_MFPL_PF1MFP_Pos)    /*!< GPF_MFPL PF1 setting for GPIO            */
#define NUMAKER_SYS_GPF_MFPL_PF1MFP_UART1_RXD       (0x2UL << NUMAKER_SYS_GPF_MFPL_PF1MFP_Pos)    /*!< GPF_MFPL PF1 setting for UART1_RXD       */
#define NUMAKER_SYS_GPF_MFPL_PF1MFP_I2C1_SDA        (0x3UL << NUMAKER_SYS_GPF_MFPL_PF1MFP_Pos)    /*!< GPF_MFPL PF1 setting for I2C1_SDA        */
#define NUMAKER_SYS_GPF_MFPL_PF1MFP_UART0_RXD       (0x4UL << NUMAKER_SYS_GPF_MFPL_PF1MFP_Pos)    /*!< GPF_MFPL PF1 setting for UART0_RXD       */
#define NUMAKER_SYS_GPF_MFPL_PF1MFP_BPWM1_CH1       (0xCUL << NUMAKER_SYS_GPF_MFPL_PF1MFP_Pos)    /*!< GPF_MFPL PF1 setting for BPWM1_CH1       */
#define NUMAKER_SYS_GPF_MFPL_PF1MFP_ICE_CLK         (0xEUL << NUMAKER_SYS_GPF_MFPL_PF1MFP_Pos)    /*!< GPF_MFPL PF1 setting for ICE_CLK         */

/* PF.2 MFP */
#define NUMAKER_SYS_GPF_MFPL_PF2MFP_GPIO            (0x0UL << NUMAKER_SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for GPIO            */
#define NUMAKER_SYS_GPF_MFPL_PF2MFP_EBI_nCS1        (0x2UL << NUMAKER_SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for EBI_nCS1        */
#define NUMAKER_SYS_GPF_MFPL_PF2MFP_UART0_RXD       (0x3UL << NUMAKER_SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for UART0_RXD       */
#define NUMAKER_SYS_GPF_MFPL_PF2MFP_I2C0_SDA        (0x4UL << NUMAKER_SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for I2C0_SDA        */
#define NUMAKER_SYS_GPF_MFPL_PF2MFP_QSPI0_CLK       (0x5UL << NUMAKER_SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for QSPI0_CLK       */
#define NUMAKER_SYS_GPF_MFPL_PF2MFP_XT1_OUT         (0xAUL << NUMAKER_SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for XT1_OUT         */
#define NUMAKER_SYS_GPF_MFPL_PF2MFP_BPWM1_CH1       (0xBUL << NUMAKER_SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for BPWM1_CH1       */

/* PF.3 MFP */
#define NUMAKER_SYS_GPF_MFPL_PF3MFP_GPIO            (0x0UL << NUMAKER_SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for GPIO            */
#define NUMAKER_SYS_GPF_MFPL_PF3MFP_EBI_nCS0        (0x2UL << NUMAKER_SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for EBI_nCS0        */
#define NUMAKER_SYS_GPF_MFPL_PF3MFP_UART0_TXD       (0x3UL << NUMAKER_SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for UART0_TXD       */
#define NUMAKER_SYS_GPF_MFPL_PF3MFP_I2C0_SCL        (0x4UL << NUMAKER_SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for I2C0_SCL        */
#define NUMAKER_SYS_GPF_MFPL_PF3MFP_XT1_IN          (0xAUL << NUMAKER_SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for XT1_IN          */
#define NUMAKER_SYS_GPF_MFPL_PF3MFP_BPWM1_CH0       (0xBUL << NUMAKER_SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for BPWM1_CH0       */

/* PF.4 MFP */
#define NUMAKER_SYS_GPF_MFPL_PF4MFP_GPIO            (0x0UL << NUMAKER_SYS_GPF_MFPL_PF4MFP_Pos)    /*!< GPF_MFPL PF4 setting for GPIO            */
#define NUMAKER_SYS_GPF_MFPL_PF4MFP_UART2_TXD       (0x2UL << NUMAKER_SYS_GPF_MFPL_PF4MFP_Pos)    /*!< GPF_MFPL PF4 setting for UART2_TXD       */
#define NUMAKER_SYS_GPF_MFPL_PF4MFP_UART2_nRTS      (0x4UL << NUMAKER_SYS_GPF_MFPL_PF4MFP_Pos)    /*!< GPF_MFPL PF4 setting for UART2_nRTS      */
#define NUMAKER_SYS_GPF_MFPL_PF4MFP_EPWM0_CH1       (0x7UL << NUMAKER_SYS_GPF_MFPL_PF4MFP_Pos)    /*!< GPF_MFPL PF4 setting for EPWM0_CH1       */
#define NUMAKER_SYS_GPF_MFPL_PF4MFP_BPWM0_CH5       (0x8UL << NUMAKER_SYS_GPF_MFPL_PF4MFP_Pos)    /*!< GPF_MFPL PF4 setting for BPWM0_CH5       */
#define NUMAKER_SYS_GPF_MFPL_PF4MFP_X32_OUT         (0xAUL << NUMAKER_SYS_GPF_MFPL_PF4MFP_Pos)    /*!< GPF_MFPL PF4 setting for X32_OUT         */

/* PF.5 MFP */
#define NUMAKER_SYS_GPF_MFPL_PF5MFP_GPIO            (0x0UL << NUMAKER_SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for GPIO            */
#define NUMAKER_SYS_GPF_MFPL_PF5MFP_UART2_RXD       (0x2UL << NUMAKER_SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for UART2_RXD       */
#define NUMAKER_SYS_GPF_MFPL_PF5MFP_UART2_nCTS      (0x4UL << NUMAKER_SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for UART2_nCTS      */
#define NUMAKER_SYS_GPF_MFPL_PF5MFP_EPWM0_CH0       (0x7UL << NUMAKER_SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for EPWM0_CH0       */
#define NUMAKER_SYS_GPF_MFPL_PF5MFP_BPWM0_CH4       (0x8UL << NUMAKER_SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for BPWM0_CH4       */
#define NUMAKER_SYS_GPF_MFPL_PF5MFP_EPWM0_SYNC_OUT  (0x9UL << NUMAKER_SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for EPWM0_SYNC_OUT  */
#define NUMAKER_SYS_GPF_MFPL_PF5MFP_X32_IN          (0xAUL << NUMAKER_SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for X32_IN          */
#define NUMAKER_SYS_GPF_MFPL_PF5MFP_EADC0_ST        (0xBUL << NUMAKER_SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for EADC0_ST        */

/* PF.6 MFP */
#define NUMAKER_SYS_GPF_MFPL_PF6MFP_GPIO            (0x0UL << NUMAKER_SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for GPIO            */
#define NUMAKER_SYS_GPF_MFPL_PF6MFP_EBI_ADR19       (0x2UL << NUMAKER_SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for EBI_ADR19       */
#define NUMAKER_SYS_GPF_MFPL_PF6MFP_SC0_CLK         (0x3UL << NUMAKER_SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for SC0_CLK         */
#define NUMAKER_SYS_GPF_MFPL_PF6MFP_I2S0_LRCK       (0x4UL << NUMAKER_SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for I2S0_LRCK       */
#define NUMAKER_SYS_GPF_MFPL_PF6MFP_SPI0_MOSI       (0x5UL << NUMAKER_SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for SPI0_MOSI       */
#define NUMAKER_SYS_GPF_MFPL_PF6MFP_UART4_RXD       (0x6UL << NUMAKER_SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for UART4_RXD       */
#define NUMAKER_SYS_GPF_MFPL_PF6MFP_EBI_nCS0        (0x7UL << NUMAKER_SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for EBI_nCS0        */
#define NUMAKER_SYS_GPF_MFPL_PF6MFP_SPI3_I2SMCLK    (0x9UL << NUMAKER_SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for SPI3_I2SMCLK    */
#define NUMAKER_SYS_GPF_MFPL_PF6MFP_TAMPER0         (0xAUL << NUMAKER_SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for TAMPER0         */

