baden/zephyr-soc-nuvoton-m2354/include/zephyr/dt-bindings/pinctrl/numaker-m2354-pinctrl.h
/* PF.7 MFP */
#define NUMAKER_SYS_GPF_MFPL_PF7MFP_GPIO            (0x0UL << NUMAKER_SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for GPIO            */
#define NUMAKER_SYS_GPF_MFPL_PF7MFP_EBI_ADR18       (0x2UL << NUMAKER_SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for EBI_ADR18       */
#define NUMAKER_SYS_GPF_MFPL_PF7MFP_SC0_DAT         (0x3UL << NUMAKER_SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for SC0_DAT         */
#define NUMAKER_SYS_GPF_MFPL_PF7MFP_I2S0_DO         (0x4UL << NUMAKER_SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for I2S0_DO         */
#define NUMAKER_SYS_GPF_MFPL_PF7MFP_SPI0_MISO       (0x5UL << NUMAKER_SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for SPI0_MISO       */
#define NUMAKER_SYS_GPF_MFPL_PF7MFP_UART4_TXD       (0x6UL << NUMAKER_SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for UART4_TXD       */
#define NUMAKER_SYS_GPF_MFPL_PF7MFP_TAMPER1         (0xAUL << NUMAKER_SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for TAMPER1         */

/* PF.8 MFP */
#define NUMAKER_SYS_GPF_MFPH_PF8MFP_GPIO            (0x0UL << NUMAKER_SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for GPIO            */
#define NUMAKER_SYS_GPF_MFPH_PF8MFP_EBI_ADR17       (0x2UL << NUMAKER_SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for EBI_ADR17       */
#define NUMAKER_SYS_GPF_MFPH_PF8MFP_SC0_RST         (0x3UL << NUMAKER_SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for SC0_RST         */
#define NUMAKER_SYS_GPF_MFPH_PF8MFP_I2S0_DI         (0x4UL << NUMAKER_SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for I2S0_DI         */
#define NUMAKER_SYS_GPF_MFPH_PF8MFP_SPI0_CLK        (0x5UL << NUMAKER_SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for SPI0_CLK        */
#define NUMAKER_SYS_GPF_MFPH_PF8MFP_UART5_nCTS      (0x6UL << NUMAKER_SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for UART5_nCTS      */
#define NUMAKER_SYS_GPF_MFPH_PF8MFP_TAMPER2         (0xAUL << NUMAKER_SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for TAMPER2         */

/* PF.9 MFP */
#define NUMAKER_SYS_GPF_MFPH_PF9MFP_GPIO            (0x0UL << NUMAKER_SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for GPIO            */
#define NUMAKER_SYS_GPF_MFPH_PF9MFP_EBI_ADR16       (0x2UL << NUMAKER_SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for EBI_ADR16       */
#define NUMAKER_SYS_GPF_MFPH_PF9MFP_SC0_PWR         (0x3UL << NUMAKER_SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for SC0_PWR         */
#define NUMAKER_SYS_GPF_MFPH_PF9MFP_I2S0_MCLK       (0x4UL << NUMAKER_SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for I2S0_MCLK       */
#define NUMAKER_SYS_GPF_MFPH_PF9MFP_SPI0_SS         (0x5UL << NUMAKER_SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for SPI0_SS         */
#define NUMAKER_SYS_GPF_MFPH_PF9MFP_UART5_nRTS      (0x6UL << NUMAKER_SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for UART5_nRTS      */
#define NUMAKER_SYS_GPF_MFPH_PF9MFP_TAMPER3         (0xAUL << NUMAKER_SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for TAMPER3         */

/* PF.10 MFP */
#define NUMAKER_SYS_GPF_MFPH_PF10MFP_GPIO           (0x0UL << NUMAKER_SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for GPIO           */
#define NUMAKER_SYS_GPF_MFPH_PF10MFP_EBI_ADR15      (0x2UL << NUMAKER_SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for EBI_ADR15      */
#define NUMAKER_SYS_GPF_MFPH_PF10MFP_SC0_nCD        (0x3UL << NUMAKER_SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for SC0_nCD        */
#define NUMAKER_SYS_GPF_MFPH_PF10MFP_I2S0_BCLK      (0x4UL << NUMAKER_SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for I2S0_BCLK      */
#define NUMAKER_SYS_GPF_MFPH_PF10MFP_SPI0_I2SMCLK   (0x5UL << NUMAKER_SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for SPI0_I2SMCLK   */
#define NUMAKER_SYS_GPF_MFPH_PF10MFP_UART5_RXD      (0x6UL << NUMAKER_SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for UART5_RXD      */
#define NUMAKER_SYS_GPF_MFPH_PF10MFP_TAMPER4        (0xAUL << NUMAKER_SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for TAMPER4        */

/* PF.11 MFP */
#define NUMAKER_SYS_GPF_MFPH_PF11MFP_GPIO           (0x0UL << NUMAKER_SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for GPIO           */
#define NUMAKER_SYS_GPF_MFPH_PF11MFP_EBI_ADR14      (0x2UL << NUMAKER_SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for EBI_ADR14      */
#define NUMAKER_SYS_GPF_MFPH_PF11MFP_SPI2_MOSI      (0x3UL << NUMAKER_SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for SPI2_MOSI      */
#define NUMAKER_SYS_GPF_MFPH_PF11MFP_UART5_TXD      (0x6UL << NUMAKER_SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for UART5_TXD      */
#define NUMAKER_SYS_GPF_MFPH_PF11MFP_TAMPER5        (0xAUL << NUMAKER_SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for TAMPER5        */
#define NUMAKER_SYS_GPF_MFPH_PF11MFP_TM5            (0xCUL << NUMAKER_SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for TM5            */
#define NUMAKER_SYS_GPF_MFPH_PF11MFP_TM3            (0xDUL << NUMAKER_SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for TM3            */

/* PG.2 MFP */
#define NUMAKER_SYS_GPG_MFPL_PG2MFP_GPIO            (0x0UL << NUMAKER_SYS_GPG_MFPL_PG2MFP_Pos)    /*!< GPG_MFPL PG2 setting for GPIO            */
#define NUMAKER_SYS_GPG_MFPL_PG2MFP_EBI_ADR11       (0x2UL << NUMAKER_SYS_GPG_MFPL_PG2MFP_Pos)    /*!< GPG_MFPL PG2 setting for EBI_ADR11       */
#define NUMAKER_SYS_GPG_MFPL_PG2MFP_SPI2_SS         (0x3UL << NUMAKER_SYS_GPG_MFPL_PG2MFP_Pos)    /*!< GPG_MFPL PG2 setting for SPI2_SS         */
#define NUMAKER_SYS_GPG_MFPL_PG2MFP_I2C0_SMBAL      (0x4UL << NUMAKER_SYS_GPG_MFPL_PG2MFP_Pos)    /*!< GPG_MFPL PG2 setting for I2C0_SMBAL      */
#define NUMAKER_SYS_GPG_MFPL_PG2MFP_I2C1_SCL        (0x5UL << NUMAKER_SYS_GPG_MFPL_PG2MFP_Pos)    /*!< GPG_MFPL PG2 setting for I2C1_SCL        */
#define NUMAKER_SYS_GPG_MFPL_PG2MFP_TM0             (0xDUL << NUMAKER_SYS_GPG_MFPL_PG2MFP_Pos)    /*!< GPG_MFPL PG2 setting for TM0             */
#define NUMAKER_SYS_GPG_MFPL_PG2MFP_LCD_SEG39       (0xFUL << NUMAKER_SYS_GPG_MFPL_PG2MFP_Pos)    /*!< GPG_MFPL PG2 setting for LCD_SEG39       */

