baden/zephyr-soc-nuvoton-m2354/include/zephyr/dt-bindings/pinctrl/numaker-m2354-pinctrl.h
/* PG.3 MFP */
#define NUMAKER_SYS_GPG_MFPL_PG3MFP_GPIO            (0x0UL << NUMAKER_SYS_GPG_MFPL_PG3MFP_Pos)    /*!< GPG_MFPL PG3 setting for GPIO            */
#define NUMAKER_SYS_GPG_MFPL_PG3MFP_EBI_ADR12       (0x2UL << NUMAKER_SYS_GPG_MFPL_PG3MFP_Pos)    /*!< GPG_MFPL PG3 setting for EBI_ADR12       */
#define NUMAKER_SYS_GPG_MFPL_PG3MFP_SPI2_CLK        (0x3UL << NUMAKER_SYS_GPG_MFPL_PG3MFP_Pos)    /*!< GPG_MFPL PG3 setting for SPI2_CLK        */
#define NUMAKER_SYS_GPG_MFPL_PG3MFP_I2C0_SMBSUS     (0x4UL << NUMAKER_SYS_GPG_MFPL_PG3MFP_Pos)    /*!< GPG_MFPL PG3 setting for I2C0_SMBSUS     */
#define NUMAKER_SYS_GPG_MFPL_PG3MFP_I2C1_SDA        (0x5UL << NUMAKER_SYS_GPG_MFPL_PG3MFP_Pos)    /*!< GPG_MFPL PG3 setting for I2C1_SDA        */
#define NUMAKER_SYS_GPG_MFPL_PG3MFP_TM1             (0xDUL << NUMAKER_SYS_GPG_MFPL_PG3MFP_Pos)    /*!< GPG_MFPL PG3 setting for TM1             */
#define NUMAKER_SYS_GPG_MFPL_PG3MFP_LCD_SEG38       (0xFUL << NUMAKER_SYS_GPG_MFPL_PG3MFP_Pos)    /*!< GPG_MFPL PG3 setting for LCD_SEG38       */

/* PG.4 MFP */
#define NUMAKER_SYS_GPG_MFPL_PG4MFP_GPIO            (0x0UL << NUMAKER_SYS_GPG_MFPL_PG4MFP_Pos)    /*!< GPG_MFPL PG4 setting for GPIO            */
#define NUMAKER_SYS_GPG_MFPL_PG4MFP_EBI_ADR13       (0x2UL << NUMAKER_SYS_GPG_MFPL_PG4MFP_Pos)    /*!< GPG_MFPL PG4 setting for EBI_ADR13       */
#define NUMAKER_SYS_GPG_MFPL_PG4MFP_SPI2_MISO       (0x3UL << NUMAKER_SYS_GPG_MFPL_PG4MFP_Pos)    /*!< GPG_MFPL PG4 setting for SPI2_MISO       */
#define NUMAKER_SYS_GPG_MFPL_PG4MFP_TM4             (0xCUL << NUMAKER_SYS_GPG_MFPL_PG4MFP_Pos)    /*!< GPG_MFPL PG4 setting for TM4             */
#define NUMAKER_SYS_GPG_MFPL_PG4MFP_TM2             (0xDUL << NUMAKER_SYS_GPG_MFPL_PG4MFP_Pos)    /*!< GPG_MFPL PG4 setting for TM2             */
#define NUMAKER_SYS_GPG_MFPL_PG4MFP_LCD_SEG37       (0xFUL << NUMAKER_SYS_GPG_MFPL_PG4MFP_Pos)    /*!< GPG_MFPL PG4 setting for LCD_SEG37       */

/* PG.9 MFP */
#define NUMAKER_SYS_GPG_MFPH_PG9MFP_GPIO            (0x0UL << NUMAKER_SYS_GPG_MFPH_PG9MFP_Pos)    /*!< GPG_MFPH PG9 setting for GPIO            */
#define NUMAKER_SYS_GPG_MFPH_PG9MFP_EBI_AD0         (0x2UL << NUMAKER_SYS_GPG_MFPH_PG9MFP_Pos)    /*!< GPG_MFPH PG9 setting for EBI_AD0         */
#define NUMAKER_SYS_GPG_MFPH_PG9MFP_BPWM0_CH5       (0xCUL << NUMAKER_SYS_GPG_MFPH_PG9MFP_Pos)    /*!< GPG_MFPH PG9 setting for BPWM0_CH5       */
#define NUMAKER_SYS_GPG_MFPH_PG9MFP_LCD_SEG21       (0xFUL << NUMAKER_SYS_GPG_MFPH_PG9MFP_Pos)    /*!< GPG_MFPH PG9 setting for LCD_SEG21       */

/* PG.10 MFP */
#define NUMAKER_SYS_GPG_MFPH_PG10MFP_GPIO           (0x0UL << NUMAKER_SYS_GPG_MFPH_PG10MFP_Pos)   /*!< GPG_MFPH PG10 setting for GPIO           */
#define NUMAKER_SYS_GPG_MFPH_PG10MFP_EBI_AD1        (0x2UL << NUMAKER_SYS_GPG_MFPH_PG10MFP_Pos)   /*!< GPG_MFPH PG10 setting for EBI_AD1        */
#define NUMAKER_SYS_GPG_MFPH_PG10MFP_BPWM0_CH4      (0xCUL << NUMAKER_SYS_GPG_MFPH_PG10MFP_Pos)   /*!< GPG_MFPH PG10 setting for BPWM0_CH4      */
#define NUMAKER_SYS_GPG_MFPH_PG10MFP_LCD_SEG20      (0xFUL << NUMAKER_SYS_GPG_MFPH_PG10MFP_Pos)   /*!< GPG_MFPH PG10 setting for LCD_SEG20      */

/* PG.11 MFP */
#define NUMAKER_SYS_GPG_MFPH_PG11MFP_GPIO           (0x0UL << NUMAKER_SYS_GPG_MFPH_PG11MFP_Pos)   /*!< GPG_MFPH PG11 setting for GPIO           */
#define NUMAKER_SYS_GPG_MFPH_PG11MFP_EBI_AD2        (0x2UL << NUMAKER_SYS_GPG_MFPH_PG11MFP_Pos)   /*!< GPG_MFPH PG11 setting for EBI_AD2        */
#define NUMAKER_SYS_GPG_MFPH_PG11MFP_BPWM0_CH3      (0xCUL << NUMAKER_SYS_GPG_MFPH_PG11MFP_Pos)   /*!< GPG_MFPH PG11 setting for BPWM0_CH3      */
#define NUMAKER_SYS_GPG_MFPH_PG11MFP_LCD_SEG19      (0xFUL << NUMAKER_SYS_GPG_MFPH_PG11MFP_Pos)   /*!< GPG_MFPH PG11 setting for LCD_SEG19      */

/* PG.12 MFP */
#define NUMAKER_SYS_GPG_MFPH_PG12MFP_GPIO           (0x0UL << NUMAKER_SYS_GPG_MFPH_PG12MFP_Pos)   /*!< GPG_MFPH PG12 setting for GPIO           */
#define NUMAKER_SYS_GPG_MFPH_PG12MFP_EBI_AD3        (0x2UL << NUMAKER_SYS_GPG_MFPH_PG12MFP_Pos)   /*!< GPG_MFPH PG12 setting for EBI_AD3        */
#define NUMAKER_SYS_GPG_MFPH_PG12MFP_BPWM0_CH2      (0xCUL << NUMAKER_SYS_GPG_MFPH_PG12MFP_Pos)   /*!< GPG_MFPH PG12 setting for BPWM0_CH2      */
#define NUMAKER_SYS_GPG_MFPH_PG12MFP_LCD_SEG18      (0xFUL << NUMAKER_SYS_GPG_MFPH_PG12MFP_Pos)   /*!< GPG_MFPH PG12 setting for LCD_SEG18      */

/* PG.13 MFP */
#define NUMAKER_SYS_GPG_MFPH_PG13MFP_GPIO           (0x0UL << NUMAKER_SYS_GPG_MFPH_PG13MFP_Pos)   /*!< GPG_MFPH PG13 setting for GPIO           */
#define NUMAKER_SYS_GPG_MFPH_PG13MFP_EBI_AD4        (0x2UL << NUMAKER_SYS_GPG_MFPH_PG13MFP_Pos)   /*!< GPG_MFPH PG13 setting for EBI_AD4        */
#define NUMAKER_SYS_GPG_MFPH_PG13MFP_BPWM0_CH1      (0xCUL << NUMAKER_SYS_GPG_MFPH_PG13MFP_Pos)   /*!< GPG_MFPH PG13 setting for BPWM0_CH1      */
#define NUMAKER_SYS_GPG_MFPH_PG13MFP_LCD_SEG17      (0xFUL << NUMAKER_SYS_GPG_MFPH_PG13MFP_Pos)   /*!< GPG_MFPH PG13 setting for LCD_SEG17      */

/* PG.14 MFP */
#define NUMAKER_SYS_GPG_MFPH_PG14MFP_GPIO           (0x0UL << NUMAKER_SYS_GPG_MFPH_PG14MFP_Pos)   /*!< GPG_MFPH PG14 setting for GPIO           */
#define NUMAKER_SYS_GPG_MFPH_PG14MFP_EBI_AD5        (0x2UL << NUMAKER_SYS_GPG_MFPH_PG14MFP_Pos)   /*!< GPG_MFPH PG14 setting for EBI_AD5        */
#define NUMAKER_SYS_GPG_MFPH_PG14MFP_BPWM0_CH0      (0xCUL << NUMAKER_SYS_GPG_MFPH_PG14MFP_Pos)   /*!< GPG_MFPH PG14 setting for BPWM0_CH0      */
#define NUMAKER_SYS_GPG_MFPH_PG14MFP_LCD_SEG16      (0xFUL << NUMAKER_SYS_GPG_MFPH_PG14MFP_Pos)   /*!< GPG_MFPH PG14 setting for LCD_SEG16      */

/* PG.15 MFP */
#define NUMAKER_SYS_GPG_MFPH_PG15MFP_GPIO           (0x0UL << NUMAKER_SYS_GPG_MFPH_PG15MFP_Pos)   /*!< GPG_MFPH PG15 setting for GPIO           */
#define NUMAKER_SYS_GPG_MFPH_PG15MFP_LCD_SEG15      (0xDUL << NUMAKER_SYS_GPG_MFPH_PG15MFP_Pos)   /*!< GPG_MFPH PG15 setting for LCD_SEG15      */
#define NUMAKER_SYS_GPG_MFPH_PG15MFP_CLKO           (0xEUL << NUMAKER_SYS_GPG_MFPH_PG15MFP_Pos)   /*!< GPG_MFPH PG15 setting for CLKO           */
#define NUMAKER_SYS_GPG_MFPH_PG15MFP_EADC0_ST       (0xFUL << NUMAKER_SYS_GPG_MFPH_PG15MFP_Pos)   /*!< GPG_MFPH PG15 setting for EADC0_ST       */

