baden/zephyr-soc-nuvoton-m2354/include/zephyr/dt-bindings/pinctrl/numaker-m2354-pinctrl.h
/* PH.4 MFP */
#define NUMAKER_SYS_GPH_MFPL_PH4MFP_GPIO            (0x0UL << NUMAKER_SYS_GPH_MFPL_PH4MFP_Pos)    /*!< GPH_MFPL PH4 setting for GPIO            */
#define NUMAKER_SYS_GPH_MFPL_PH4MFP_EBI_ADR3        (0x2UL << NUMAKER_SYS_GPH_MFPL_PH4MFP_Pos)    /*!< GPH_MFPL PH4 setting for EBI_ADR3        */
#define NUMAKER_SYS_GPH_MFPL_PH4MFP_SPI1_MISO       (0x3UL << NUMAKER_SYS_GPH_MFPL_PH4MFP_Pos)    /*!< GPH_MFPL PH4 setting for SPI1_MISO       */
#define NUMAKER_SYS_GPH_MFPL_PH4MFP_LCD_SEG36       (0xFUL << NUMAKER_SYS_GPH_MFPL_PH4MFP_Pos)    /*!< GPH_MFPL PH4 setting for LCD_SEG36       */

/* PH.5 MFP */
#define NUMAKER_SYS_GPH_MFPL_PH5MFP_GPIO            (0x0UL << NUMAKER_SYS_GPH_MFPL_PH5MFP_Pos)    /*!< GPH_MFPL PH5 setting for GPIO            */
#define NUMAKER_SYS_GPH_MFPL_PH5MFP_EBI_ADR2        (0x2UL << NUMAKER_SYS_GPH_MFPL_PH5MFP_Pos)    /*!< GPH_MFPL PH5 setting for EBI_ADR2        */
#define NUMAKER_SYS_GPH_MFPL_PH5MFP_SPI1_MOSI       (0x3UL << NUMAKER_SYS_GPH_MFPL_PH5MFP_Pos)    /*!< GPH_MFPL PH5 setting for SPI1_MOSI       */
#define NUMAKER_SYS_GPH_MFPL_PH5MFP_LCD_SEG35       (0xFUL << NUMAKER_SYS_GPH_MFPL_PH5MFP_Pos)    /*!< GPH_MFPL PH5 setting for LCD_SEG35       */

/* PH.6 MFP */
#define NUMAKER_SYS_GPH_MFPL_PH6MFP_GPIO            (0x0UL << NUMAKER_SYS_GPH_MFPL_PH6MFP_Pos)    /*!< GPH_MFPL PH6 setting for GPIO            */
#define NUMAKER_SYS_GPH_MFPL_PH6MFP_EBI_ADR1        (0x2UL << NUMAKER_SYS_GPH_MFPL_PH6MFP_Pos)    /*!< GPH_MFPL PH6 setting for EBI_ADR1        */
#define NUMAKER_SYS_GPH_MFPL_PH6MFP_SPI1_CLK        (0x3UL << NUMAKER_SYS_GPH_MFPL_PH6MFP_Pos)    /*!< GPH_MFPL PH6 setting for SPI1_CLK        */
#define NUMAKER_SYS_GPH_MFPL_PH6MFP_LCD_SEG34       (0xFUL << NUMAKER_SYS_GPH_MFPL_PH6MFP_Pos)    /*!< GPH_MFPL PH6 setting for LCD_SEG34       */

/* PH.7 MFP */
#define NUMAKER_SYS_GPH_MFPL_PH7MFP_GPIO            (0x0UL << NUMAKER_SYS_GPH_MFPL_PH7MFP_Pos)    /*!< GPH_MFPL PH7 setting for GPIO            */
#define NUMAKER_SYS_GPH_MFPL_PH7MFP_EBI_ADR0        (0x2UL << NUMAKER_SYS_GPH_MFPL_PH7MFP_Pos)    /*!< GPH_MFPL PH7 setting for EBI_ADR0        */
#define NUMAKER_SYS_GPH_MFPL_PH7MFP_SPI1_SS         (0x3UL << NUMAKER_SYS_GPH_MFPL_PH7MFP_Pos)    /*!< GPH_MFPL PH7 setting for SPI1_SS         */
#define NUMAKER_SYS_GPH_MFPL_PH7MFP_LCD_SEG33       (0xFUL << NUMAKER_SYS_GPH_MFPL_PH7MFP_Pos)    /*!< GPH_MFPL PH7 setting for LCD_SEG33       */

/* PH.8 MFP */
#define NUMAKER_SYS_GPH_MFPH_PH8MFP_GPIO            (0x0UL << NUMAKER_SYS_GPH_MFPH_PH8MFP_Pos)    /*!< GPH_MFPH PH8 setting for GPIO            */
#define NUMAKER_SYS_GPH_MFPH_PH8MFP_EBI_AD12        (0x2UL << NUMAKER_SYS_GPH_MFPH_PH8MFP_Pos)    /*!< GPH_MFPH PH8 setting for EBI_AD12        */
#define NUMAKER_SYS_GPH_MFPH_PH8MFP_QSPI0_CLK       (0x3UL << NUMAKER_SYS_GPH_MFPH_PH8MFP_Pos)    /*!< GPH_MFPH PH8 setting for QSPI0_CLK       */
#define NUMAKER_SYS_GPH_MFPH_PH8MFP_SC2_PWR         (0x4UL << NUMAKER_SYS_GPH_MFPH_PH8MFP_Pos)    /*!< GPH_MFPH PH8 setting for SC2_PWR         */
#define NUMAKER_SYS_GPH_MFPH_PH8MFP_I2S0_DI         (0x5UL << NUMAKER_SYS_GPH_MFPH_PH8MFP_Pos)    /*!< GPH_MFPH PH8 setting for I2S0_DI         */
#define NUMAKER_SYS_GPH_MFPH_PH8MFP_SPI1_CLK        (0x6UL << NUMAKER_SYS_GPH_MFPH_PH8MFP_Pos)    /*!< GPH_MFPH PH8 setting for SPI1_CLK        */
#define NUMAKER_SYS_GPH_MFPH_PH8MFP_UART3_nRTS      (0x7UL << NUMAKER_SYS_GPH_MFPH_PH8MFP_Pos)    /*!< GPH_MFPH PH8 setting for UART3_nRTS      */
#define NUMAKER_SYS_GPH_MFPH_PH8MFP_I2C1_SMBAL      (0x8UL << NUMAKER_SYS_GPH_MFPH_PH8MFP_Pos)    /*!< GPH_MFPH PH8 setting for I2C1_SMBAL      */
#define NUMAKER_SYS_GPH_MFPH_PH8MFP_I2C2_SCL        (0x9UL << NUMAKER_SYS_GPH_MFPH_PH8MFP_Pos)    /*!< GPH_MFPH PH8 setting for I2C2_SCL        */
#define NUMAKER_SYS_GPH_MFPH_PH8MFP_UART1_TXD       (0xAUL << NUMAKER_SYS_GPH_MFPH_PH8MFP_Pos)    /*!< GPH_MFPH PH8 setting for UART1_TXD       */
#define NUMAKER_SYS_GPH_MFPH_PH8MFP_LCD_SEG4        (0xFUL << NUMAKER_SYS_GPH_MFPH_PH8MFP_Pos)    /*!< GPH_MFPH PH8 setting for LCD_SEG4        */

/* PH.9 MFP */
#define NUMAKER_SYS_GPH_MFPH_PH9MFP_GPIO            (0x0UL << NUMAKER_SYS_GPH_MFPH_PH9MFP_Pos)    /*!< GPH_MFPH PH9 setting for GPIO            */
#define NUMAKER_SYS_GPH_MFPH_PH9MFP_EBI_AD13        (0x2UL << NUMAKER_SYS_GPH_MFPH_PH9MFP_Pos)    /*!< GPH_MFPH PH9 setting for EBI_AD13        */
#define NUMAKER_SYS_GPH_MFPH_PH9MFP_QSPI0_SS        (0x3UL << NUMAKER_SYS_GPH_MFPH_PH9MFP_Pos)    /*!< GPH_MFPH PH9 setting for QSPI0_SS        */
#define NUMAKER_SYS_GPH_MFPH_PH9MFP_SC2_RST         (0x4UL << NUMAKER_SYS_GPH_MFPH_PH9MFP_Pos)    /*!< GPH_MFPH PH9 setting for SC2_RST         */
#define NUMAKER_SYS_GPH_MFPH_PH9MFP_I2S0_DO         (0x5UL << NUMAKER_SYS_GPH_MFPH_PH9MFP_Pos)    /*!< GPH_MFPH PH9 setting for I2S0_DO         */
#define NUMAKER_SYS_GPH_MFPH_PH9MFP_SPI1_SS         (0x6UL << NUMAKER_SYS_GPH_MFPH_PH9MFP_Pos)    /*!< GPH_MFPH PH9 setting for SPI1_SS         */
#define NUMAKER_SYS_GPH_MFPH_PH9MFP_UART3_nCTS      (0x7UL << NUMAKER_SYS_GPH_MFPH_PH9MFP_Pos)    /*!< GPH_MFPH PH9 setting for UART3_nCTS      */
#define NUMAKER_SYS_GPH_MFPH_PH9MFP_I2C1_SMBSUS     (0x8UL << NUMAKER_SYS_GPH_MFPH_PH9MFP_Pos)    /*!< GPH_MFPH PH9 setting for I2C1_SMBSUS     */
#define NUMAKER_SYS_GPH_MFPH_PH9MFP_I2C2_SDA        (0x9UL << NUMAKER_SYS_GPH_MFPH_PH9MFP_Pos)    /*!< GPH_MFPH PH9 setting for I2C2_SDA        */
#define NUMAKER_SYS_GPH_MFPH_PH9MFP_UART1_RXD       (0xAUL << NUMAKER_SYS_GPH_MFPH_PH9MFP_Pos)    /*!< GPH_MFPH PH9 setting for UART1_RXD       */
#define NUMAKER_SYS_GPH_MFPH_PH9MFP_LCD_SEG3        (0xFUL << NUMAKER_SYS_GPH_MFPH_PH9MFP_Pos)    /*!< GPH_MFPH PH9 setting for LCD_SEG3        */

/* PH.10 MFP */
#define NUMAKER_SYS_GPH_MFPH_PH10MFP_GPIO           (0x0UL << NUMAKER_SYS_GPH_MFPH_PH10MFP_Pos)   /*!< GPH_MFPH PH10 setting for GPIO           */
#define NUMAKER_SYS_GPH_MFPH_PH10MFP_EBI_AD14       (0x2UL << NUMAKER_SYS_GPH_MFPH_PH10MFP_Pos)   /*!< GPH_MFPH PH10 setting for EBI_AD14       */
#define NUMAKER_SYS_GPH_MFPH_PH10MFP_QSPI0_MISO1    (0x3UL << NUMAKER_SYS_GPH_MFPH_PH10MFP_Pos)   /*!< GPH_MFPH PH10 setting for QSPI0_MISO1    */
#define NUMAKER_SYS_GPH_MFPH_PH10MFP_SC2_nCD        (0x4UL << NUMAKER_SYS_GPH_MFPH_PH10MFP_Pos)   /*!< GPH_MFPH PH10 setting for SC2_nCD        */
#define NUMAKER_SYS_GPH_MFPH_PH10MFP_I2S0_LRCK      (0x5UL << NUMAKER_SYS_GPH_MFPH_PH10MFP_Pos)   /*!< GPH_MFPH PH10 setting for I2S0_LRCK      */
#define NUMAKER_SYS_GPH_MFPH_PH10MFP_SPI1_I2SMCLK   (0x6UL << NUMAKER_SYS_GPH_MFPH_PH10MFP_Pos)   /*!< GPH_MFPH PH10 setting for SPI1_I2SMCLK   */
#define NUMAKER_SYS_GPH_MFPH_PH10MFP_UART4_TXD      (0x7UL << NUMAKER_SYS_GPH_MFPH_PH10MFP_Pos)   /*!< GPH_MFPH PH10 setting for UART4_TXD      */
#define NUMAKER_SYS_GPH_MFPH_PH10MFP_UART0_TXD      (0x8UL << NUMAKER_SYS_GPH_MFPH_PH10MFP_Pos)   /*!< GPH_MFPH PH10 setting for UART0_TXD      */
#define NUMAKER_SYS_GPH_MFPH_PH10MFP_LCD_SEG2       (0xFUL << NUMAKER_SYS_GPH_MFPH_PH10MFP_Pos)   /*!< GPH_MFPH PH10 setting for LCD_SEG2       */

/* PH.11 MFP */
#define NUMAKER_SYS_GPH_MFPH_PH11MFP_GPIO           (0x0UL << NUMAKER_SYS_GPH_MFPH_PH11MFP_Pos)   /*!< GPH_MFPH PH11 setting for GPIO           */
#define NUMAKER_SYS_GPH_MFPH_PH11MFP_EBI_AD15       (0x2UL << NUMAKER_SYS_GPH_MFPH_PH11MFP_Pos)   /*!< GPH_MFPH PH11 setting for EBI_AD15       */
#define NUMAKER_SYS_GPH_MFPH_PH11MFP_QSPI0_MOSI1    (0x3UL << NUMAKER_SYS_GPH_MFPH_PH11MFP_Pos)   /*!< GPH_MFPH PH11 setting for QSPI0_MOSI1    */
#define NUMAKER_SYS_GPH_MFPH_PH11MFP_UART4_RXD      (0x7UL << NUMAKER_SYS_GPH_MFPH_PH11MFP_Pos)   /*!< GPH_MFPH PH11 setting for UART4_RXD      */
#define NUMAKER_SYS_GPH_MFPH_PH11MFP_UART0_RXD      (0x8UL << NUMAKER_SYS_GPH_MFPH_PH11MFP_Pos)   /*!< GPH_MFPH PH11 setting for UART0_RXD      */
#define NUMAKER_SYS_GPH_MFPH_PH11MFP_EPWM0_CH5      (0xBUL << NUMAKER_SYS_GPH_MFPH_PH11MFP_Pos)   /*!< GPH_MFPH PH11 setting for EPWM0_CH5      */
#define NUMAKER_SYS_GPH_MFPH_PH11MFP_LCD_SEG1       (0xFUL << NUMAKER_SYS_GPH_MFPH_PH11MFP_Pos)   /*!< GPH_MFPH PH11 setting for LCD_SEG1       */

/* End of M2354 BSP sys.h pin-mux module copy */

#endif
